{
    "ID": 114,
    "Name": "Australian Sign Language signs",
    "Abstract": "This data consists of sample of Auslan (Australian Sign Language) signs. Examples of 95 signs were collected from five signers with a total of 6650 sign samples.",
    "Types": "Multivariate, Time-Series",
    "Task": "Classification",
    "AttributeTypes": "Categorical, Real",
    "NumInstances": 6650,
    "NumAttributes": 15,
    "DateDonated": "1999-04-20",
    "MissingValues": 0,
    "URLFolder": "../machine-learning-databases/auslan-mld/",
    "URLReadme": "../machine-learning-databases/auslan-mld/auslan.data.html",
    "HighestAccuracy": 0,
    "RelevantInfo": "The source of the data is the raw measurements from a Nintendo PowerGlove. It was interfaced through a PowerGlove Serial Interface to a Silicon Graphics 4D/35G workstation. \r\n\r\nThis glove definitely falls into the category of \"cheap and nasty\". Position information is calculated on the basis of ultrasound emissions from emitters the glove to a 3-microphone \"L-Bar\" that sits atop a monitor. There are two emitters on the glove; and three receivers. This allows the calculation of 4 pieces of information: x (left/right), y (up/down), z (backward/forward), and roll (is the palm pointing up or down?). x, y and z are measured with 8 bit accuracy. \"x, y, z\" should not be taken to be the normal 3-dimensional orthogonal basis. In particular, 1 unit in the z direction is not of similar distance to 1 unit in the x or y directions. These x, y, z positions are relative to a calibration point which is when the palm is resting on the seated signer's thigh. Roll is 4 bits. \r\n\r\nThe data is susceptible to occasional \"spikes\" caused by random ultrasound noise. Median filters have been found to be beneficial in solving this problem. \r\n\r\nFinger bend is generated by conductive bend sensors on the first four fingers. Values vary between 0 (straight) and 3 (fully bent). Accuracy is 2 bits. The gloves automatically apply a hysteresis filter on these bend sensors. At best, these measurements should be treated sceptically. \r\n\r\nSee past usage for a more detailed discussion on the data collection methodology. \r\n\r\nThe data was collected from five signers: \r\n \r\nSigner -- Description -- Sessions -- Total samples/sign\r\n\r\n Adam -- Sign linguist - PhD completed in area. -- 2 -- 8\r\n Andrew -- Natural signer - signing since youth -- 3 -- 8\r\n John -- Professional Auslan interpreter -- 5 -- 18\r\n Stephen -- Professional Auslan interpreter -- 4  -- 16\r\n Waleed -- The researcher. Novice signer -- 4 -- 20\r\n\r\nEach session was taken at a different time, after a break, etc. \r\n\r\nThe \"adam\" dataset were sampled in a fixed order -- this means that they are subject to fatigue effects, etc. All other datasets were sampled in random order. The \"waleed\" and \"stephen\" datasets contain signs that begin with \"cal-\". These were considered as a means of calibration, but didn't work out too well. \r\n\r\nThe data presented is the raw data with no filtering. \r\n\r\nOccasional dropouts in x, y, z values. These can be easily fixed using a median filter. \r\n\r\nAverage number of frames per instance is 51, but varies from 30 to 102. \r\n\r\nThe data is in a comma separated file containing all of the attributes mentioned above. Each sign sample is stored in a single file. The directory hierarchy is as follows: \r\n-Each signer is in a separate directory. \r\n-Each session from signer is in a subdirectory. Each session is denoted by a number. \r\n-Each sample is in a file named by the sample appended with the number of the sample of that sign. \r\n\r\nThe filenames indicate the class. ",
    "Source": "Original Owner and Donor:\r\n\r\nMohammed Waleed Kadous\r\nSchool of Computer Science of Engineering\r\nUniversity of New South Wales\r\nSydney NSW 2052 Australia\r\nwaleed@cse.unsw.edu.au\r\n",
    "Acknowledgements": "The data may be used provided that: \r\n-The source of the data (http://www.cse.unsw.edu.au/~waleed/tml/data/) is acknowledged. \r\n-If you publish any work using the dataset, please inform the donor. \r\n-Use for commercial purposes requires donor permission. ",
    "Area": "Other",
    "RelevantPapers": "M. W. Kadous, GRASP: Recognition of Australian Sign Language using Instrumented Gloves, Honours thesis, School of Computer Science and Engineering, University of New South Wales, 1995. \r\nhttp://rexa.info/paper/75d0fad5fa929ac8157a6ac10e4ae14da86d186e",
    "AttributeInfo": "x:\r\n  - Continuous. \r\n  - Description: x position between -1 and 1. Units are *approximately* metres. \r\ny: \r\n  - Continuous. \r\n  - Description: y position between -1 and 1. Units are approximately metres. \r\nz: \r\n  - Continuous. \r\n  - Description: z position between -1 and 1. Units are not metres. \r\n     This space should not really be treated as linear, although it is safe to\r\n     treat it as monotonically increasing. \r\nroll:      \r\n  - Continuous.\r\n  - Description:  roll with 0 meaning \"palm down\", rotating clcokwise through to a maximum of 1 (not included), which is also \"palm down\".\r\npitch: \r\n   - Has a value of -1, indicating that it is not available for this data. \r\n   Should be ignored. \r\nyaw: \r\n   - Has a value of -1, indicating that it is not available for this data. \r\n    Should be ignored. \r\nthumb: \r\n   - Continuous. \r\n   - Description: Thumb bend. has a value of 0 (straight) to 1 (fully bent). \r\nfore:\r\n   - Continuous. \r\n   - Description: Forefinger bend. has a value of 0 (straight) to 1 (fully bent). \r\nindex:\r\n   - Continuous. \r\n   - Description: Index finger bend. has a value of 0 (straight) to 1 (fully bent). \r\nring: \r\n   - Continuous. \r\n   - Description: Ring finger bend. has a value of 0 (straight) to 1 (fully bent). \r\nlittle:      \r\n   - In this case, it is a copy of ring bend. Should be ignored. \r\nkeycode: \r\n   - Indicates which key was pressed on the glove. Should be ignored. \r\ngs1:      \r\n   - glove state 1 Should be ignored. \r\ngs2:      \r\n   - glove state 2 should be ignored. \r\nReceiver values: \r\n  - Determines if all receivers received values from all transmitters. A value of 0x3F indicates all receivers received information from all transmitters. Other values indicate this is not the case.\r\n",
    "FormatType": "Dense-Matrix",
    "NumHits": 8655
}