{
    "ID": 115,
    "Name": "Australian Sign Language signs (High Quality)",
    "Abstract": "This data consists of sample of Auslan (Australian Sign Language) signs. 27 examples of each of 95 Auslan signs were captured from a native signer using high-quality position trackers",
    "Types": "Multivariate, Time-Series",
    "Task": "Classification",
    "AttributeTypes": "Real",
    "NumInstances": 2565,
    "NumAttributes": 22,
    "DateDonated": "2002-02-26",
    "MissingValues": 0,
    "URLFolder": "../machine-learning-databases/auslan2-mld/",
    "URLReadme": "../machine-learning-databases/auslan2-mld/auslan.data.html",
    "HighestAccuracy": 0,
    "RelevantInfo": "Data was captured using a setup that consisted of: \r\n\r\n- Two Fifth Dimension Technologies (5DT) gloves, one right and one left \r\n- Two Ascension Flock-of-Birds magnetic position trackers, one attached to each hand \r\n- A four-port serial card to cope with four data sources \r\n- A PC (128MB RAM, Intel Pentium II 266MHz) was used \r\n\r\nIn terms of the quality of the data, the Flock system was far superior to the Nintendo system also available from the same donor. Firstly, this was a two-hand system. Secondly, each position tracker provided 6 degrees of freedom - i.e. roll, pitch and yaw as well as x, y and z. The gloves also provided a full five fingers of data. But the big improvements were in resolution - both accuracy and temporal. Position and orientation were defined to 14-bit accuracy, giving position information with a typical positional error less than one centimetre and angle error less than one half of a degree. Finger bend was measured with 8 bits per finger, of which probably 6 bits were usable once the glove was calibrated. The refresh rate of the complete system was close to 100 frames per second; and all signals had significantly less noise than the Nintendo data. \r\n\r\nSamples from a single signer (a native Auslan signer) were collected over a period of nine weeks. In total, 27 samples per sign, and a total of 2565 signs were collected. The average length of each sign was approximately 57 frames. \r\n\r\nThe data was collected from a volunteer native Auslan signer \r\n\r\nThe data presented is the raw data with no filtering. \r\n\r\nThe file consists of 9 subdirectories tctodd1-9. Each directory consists of 3 samples of each sign, captured on a different day. In total there are 95 different signs, with 27 samples per sign. Signs were provided by a native signer volunteer. \r\n\r\nEach file consists of a sequence of lines. Each line consists of 22 whitespace-separated numbers representing the 22 channels of information. The list of channels can be found in the domain description file. It also lists the classes. More information can be found here: http://www.cse.unsw.edu.au/~waleed/phd/html/node126.html.\r\n\r\n \r\n\r\n",
    "Source": "Original Owner and Donor:\r\n\r\nMohammed Waleed Kadous\r\nSchool of Computer Science of Engineering\r\nUniversity of New South Wales\r\nSydney NSW 2052 Australia\r\nTel: 61 2 9385 6922\r\nwaleed@cse.unsw.edu.au\r\n",
    "Acknowledgements": "Please cite the PhD thesis above as the data source: \r\n\r\nKadous, M. W., \"Temporal Classification: Extending the Classification\r\nParadigm to Multivariate Time Series\", PhD Thesis (draft), School of\r\nComputer Science and Engineering, University of New South Wales, 2002.\r\n\r\n",
    "Area": "Other",
    "RelevantPapers": "Kadous, M. W., \"Temporal Classification: Extending the Classification Paradigm to Multivariate Time Series\", PhD Thesis (draft), School of Computer Science and Engineering, University of New South Wales, 2002.\r\nhttp://rexa.info/paper/f1d47fa9bf607f7fb175ca5fac697385e47dd09b\r\n\r\nAlso available from: http://www.cse.unsw.edu.au/~waleed/phd/ \r\n",
    "AttributeInfo": "The following data were recorded for each hand:\r\n\r\n* x position expressed relative to a zero point set slightly below the chin. Expressed in meters.\r\n\r\n* y position expressed relative to a zero point set slightly below the chin. Expressed in meters.\r\n\r\n* z position expressed relative to a zero point set slightly below the chin. Expressed in meters.\r\n\r\n* roll expressed as a value between -0.5 and 0.5 with 0 being palm down. Positive means the palm is rolled clockwise from the perspective of the signer. To get degrees, multiply by 180.\r\n\r\n* pitch expressed as a value between -0.5 and 0.5 with 0 being palm flat (horizontal). Positive means the palm is pointing up. To get degrees, multiply by 180.\r\n\r\n* yaw expressed a value between -1.0 and 1.0 with 0 being palm straight ahead from the perspective of the signer. Positive means clockwise from the perspective above the signer. To get degrees, multiply by 180.\r\n\r\n* Thumb bend measure between 0 and 1. 0 means totally flat, 1 means totally bent. However, the finger bend measurements are not very exact.\r\n\r\n* Forefinger bend measure between 0 and 1. 0 means totally flat, 1 means totally bent. However, the finger bend measurements are not very exact.\r\n\r\n* Middle finger bend measure between 0 and 1. 0 means totally flat, 1 means totally bent. However, the finger bend measurements are not very exact.\r\n\r\n* Ring finger bend measure between 0 and 1. 0 means totally flat, 1 means totally bent. However, the finger bend measurements are not very exact.\r\n\r\n* Little finger bend measure between 0 and 1. 0 means totally flat, 1 means totally bent. However, the finger bend measurements are not very exact.\r\n",
    "FormatType": "Dense-Matrix",
    "NumHits": 6658
}