{
    "ID": 135,
    "Name": "Pioneer-1 Mobile Robot Data",
    "Abstract": "This dataset contains time series sensor readings of the Pioneer-1 mobile robot. The data is broken into \"experiences\" in which the robot takes action for some period of time and experiences a control",
    "Types": "Multivariate, Time-Series",
    "Task": "",
    "AttributeTypes": "Categorical, Real",
    "NumInstances": 0,
    "NumAttributes": 0,
    "DateDonated": "1999-01-28",
    "MissingValues": 0,
    "URLFolder": "../machine-learning-databases/pioneer-mld/",
    "URLReadme": "../machine-learning-databases/pioneer-mld/pioneer.data.html",
    "HighestAccuracy": 0,
    "RelevantInfo": "The data were collected over a series of specifically designed trials. Our hope was to cover most of the types of sensory interactions that a Pioneer might be reasonably expected to encounter: things like passing by visible objects, pushing visible objects, crashing into walls, etc. Many of these interactions are repeated throughout the dataset.\r\n\r\nThis data was collected to serve as the basis for work in learning and conceptual development. Our first goal was to be able to have the robot cluster these experiences by their dynamics on their own into clusters of experiences with a common outcome.\r\n\r\nEach data file contains time series data in which each row of data corresponds to a single observation of the sensor array. Included in each row are two additional variables, 'id' and 'description', which indicate the experience number that the observation belongs to, and a description of that experience, respectively. Observations within an experience are taken every 100ms. \r\n\r\nThe data is stored in three text files: one file for experiences in which the Pioneer was moving in a straight line, one in which it was turning in place, and one in which it was raising or lowering its gripper.\r\n\r\nThe description variable is a string of symbols. The string breaks down as follows:\r\n\r\n\"u\" or \"o\" -  unobstructed or obstructed\r\n\"x.xs\"     -  activity lasted x.x seconds\r\nactivity   -  the activity and speed, if applicable, i.e. move100 = move forward at 100mm/sec\r\nvisual     -  objects in the visual array are listed in sequence. \"cAHEAD\" indicates an object visible to channel c directly AHEAD of the Pioneer.\r\n[visual.X] -  visual descriptions followed by a '.' and one character indicate that something special happens with the visible object. .V means the object Vanishes from sight during the activity. .D indicates that the object is Discovered (becomes visible) during the activity. .P indicates that the object is pushed. \r\n\r\nAn example: \"u-3.5s-retr-100-aRIGHT.D\"  An unobstructed retreat (move) at -100 mm/sec for 3.5 seconds with an object being discovered in channel A.\r\n\r\nIt should be noted that, particularly with respect to the visual channels, the description may not be 100% accurate. Since the visual channels respond to colors that they are trained on (visual a=red, visual b=yellow, visual c=blue), it was possible, but infrequent, for some extraneous object in the environment generated a response in visual channels that were not supposed to show activity in a particular trial.\r\n\r\nRows are seperated by carriage returns, columns by commas. ",
    "Source": "Matthew D. Schmill, Paul R. Cohen\r\nExperimental Knowledge Systems Laboratory \r\nDepartment of Computer Science \r\nBox 34610 \r\nUniversity of Massachusetts, Amherst \r\nAmherst, MA 01003-4610 \r\nschmill@cs.umass.edu, cohen@cs.umass.edu",
    "Acknowledgements": "The work represented here was funded by DARPA contracts F49620-97-1-0485 and N66001-96-C-8504.\r\n\r\nFor research use only. ",
    "Area": "Computer",
    "RelevantPapers": "Oates, Tim; Schmill, Matthew D. and Cohen, Paul R. Identifying Qualitatively Different Experiences: Experiments with a Mobile Robot.\r\nhttp://rexa.info/paper/604cf86186813a56fb42b25a3065e0a6ecd14711\r\n\r\nSchmill, Matthew D.; Oates, Tim; and Cohen, Paul R. Learned Models for Continuous Planning. Seventh International Workshop on Artificial Intelligence and Statistics. \r\nhttp://rexa.info/paper/b655463ad6c49f9a37468db4aa77683efb5f8fc0",
    "AttributeInfo": "TRIAL-ID\t: categorical, the trial id of the experience that the observation belongs to\r\nDESCRIPTION\t: a symbolic description of the experience design\r\nTIME-SECS\t: a reading of the Pioneer's internal clock, in seconds\r\nBATTERY-LEVEL\t: a reading of battery level, in volts\r\nSONAR-0\t\t: sonar depth reading, in mm, of the left (90) pointing sonar\r\nSONAR-1\t\t: sonar depth reading, in mm, of a (15) pointing sonar\r\nSONAR-2 \t: sonar depth reading, in mm, of a (7.5) pointing sonar\r\nSONAR-3 \t: sonar depth reading, in mm, of a forward (0) pointing sonar\r\nSONAR-4 \t: sonar depth reading, in mm, of a (-7.5) pointing sonar\r\nSONAR-5 \t: sonar depth reading, in mm, of a (-15) pointing sonar\r\nSONAR-6 \t: sonar depth reading, in mm, of a right (-90) pointing sonar\r\nHEADING\t\t: heading reading, in degrees, from the robot's \"true north\"\r\nR-WHEEL-VEL\t: right wheel velocity, in mm/sec\r\nL-WHEEL-VEL\t: left wheel velocity, in mm/sec\r\nTRANS-VEL\t: translational velocity, mm/sec\r\nROT-VEL\t\t: rotational velocity, mm/sec\r\nR-STALL\t\t: right wheel stall sensor, binary (0/1)\r\nL-STALL\t\t: left wheel stall sensor, binary (0/1)\r\nROBOT-STATUS\t: robot status, 2.0 = stationary, 3.0 = moving\r\nGRIP-STATE\t: gripper state\r\nGRIP-FRONT-BEAM : gripper break beam, binary, 1.0 = broken\r\nGRIP-REAR-BEAM\t: gripper break beam, binary, 1.0 = broken\r\nGRIP-BUMPER\t: gripper bumper, binary, 1.0 = in contact\r\nVIS-A-AREA\t: area of dominant visible object for channel A, in pixels\r\nVIS-A-X\t\t: X location of object in channel A on image plane, -140 ... 140\r\nVIS-A-Y\t\t: Y location of channel A on image plane\r\nVIS-A-H\t\t: height of object in channel A on plane, in pixels\r\nVIS-A-W\t\t: width of object in A on image plane, in pixels\r\nVIS-A-DIST\t: distance to object in channel A, in mm\r\nVIS-B-AREA\t: area of dominant visible object for channel B, in pixels\r\nVIS-B-X\t\t: X location of object in channel B on image plane, -140 ... 140\r\nVIS-B-Y\t\t: Y location of channel B on image plane\r\nVIS-B-H\t\t: height of object in channel B on plane, in pixels\r\nVIS-B-W\t\t: width of object in B on image plane, in pixels\r\nVIS-B-DIST\t: distance to object in channel B, in mm\r\nVIS-C-AREA\t: area of dominant visible object for channel C, in pixels\r\nVIS-C-X\t\t: X location of object in channel C on image plane, -140 ... 140\r\nVIS-C-Y\t\t: Y location of channel C on image plane\r\nVIS-C-H\t\t: height of object in C on image plane, in pixels\r\nVIS-C-W\t\t: width of object in C on image plane, in pixels\r\nVIS-C-DIST\t: distance to object in channel C, in mm\r\n\r\nFor the visual variables, when there is no visible object, width = 0, height = 0, area = 0, distance = 10000.0, Y = 0, X = 140.0. The sonars report 5201.0 as their maximum distance. ",
    "FormatType": "Dense-Matrix, Multiple",
    "NumHits": 12
}