{
    "ID": 136,
    "Name": "Pseudo Periodic Synthetic Time Series",
    "Abstract": "This data set is designed for testing indexing schemes in time series databases. The data appears highly periodic, but never exactly repeats itself.",
    "Types": "Univariate, Time-Series",
    "Task": "",
    "AttributeTypes": "",
    "NumInstances": 100000,
    "NumAttributes": 0,
    "DateDonated": "1999-02-08",
    "MissingValues": 0,
    "URLFolder": "../machine-learning-databases/synthetic-mld/",
    "URLReadme": "../machine-learning-databases/synthetic-mld/synthetic.data.html",
    "HighestAccuracy": 0,
    "RelevantInfo": "This data set is designed for testing indexing schemes in time series databases. It is a much larger dataset than has been used in any published study (That we are currently aware of). It contains one million data points. The data has been split into 10 sections to facilitate testing (see below). We recommend building the index with 9 of the 100,000-datapoint sections, and randomly extracting a query shape from the 10th section. (Some previously published work seems to have used queries that were also used to build the indexing structure. This will produce optimistic results) The data are interesting because they have structure at different resolutions. Each of the 10 sections where generated by independent invocations of the function: (see equation.gif)\r\n\r\nWhere rand(x) produces a random integer between zero and x.\r\n\r\nThe data appears highly periodic, but never exactly repeats itself. This feature is designed to challenge the indexing structure. The time series are ploted here: (ts1-5.gif), (ts6-10.gif)",
    "Source": "Eamonn J. Keogh and Michael J. Pazzani\r\nDepartment of Information and Computer Science\r\nUniversity of California, Irvine, California 92697 USA\r\neamonn@ics.uci.edu, pazzani@ics.uci.edu\r\n",
    "Acknowledgements": "Freely available for research use.\r\n",
    "Area": "Other",
    "RelevantPapers": "Eamonn J. Keogh, Michael J. Pazzani: (1999). An indexing scheme for similarity search in large time series databases. The 11th International Conference on Scientific and Statistical Database Management. Cleveland, Ohio.\r\nhttp://rexa.info/paper/e6e50efe39805bceb8c7b003dcb952237680f9f4\r\n\r\nSanghyun Park, Dongwon Lee, and Wesley W. Chu. \"Fast Retrieval of Similar Subsequences in Long Sequence Databases\", In 3rd IEEE Knowledge and Data Engineering Exchange Workshop (KDEX), Chicago, IL, USA, November, 1999\r\nhttp://rexa.info/paper/e0aefacc7d612ea11a7db94e5377072861c622c5",
    "AttributeInfo": "The data is stored in one ASCII file. There are 10 columns, 100,000 rows. All data points are in the range -0.5 to +0.5.\r\n\r\nRows are separated by carriage returns, columns by spaces. ",
    "FormatType": "",
    "NumHits": 16
}