{
    "ID": 141,
    "Name": "UNIX User Data",
    "Abstract": "This file contains 9 sets of sanitized user data drawn from the command histories of 8 UNIX computer users at Purdue over the course of up to 2 years.",
    "Types": "Text, Sequential",
    "Task": "",
    "AttributeTypes": "",
    "NumInstances": 0,
    "NumAttributes": 0,
    "DateDonated": "",
    "MissingValues": 0,
    "URLFolder": "../machine-learning-databases/UNIX_user_data-mld/",
    "URLReadme": "../machine-learning-databases/UNIX_user_data-mld/README",
    "HighestAccuracy": 0,
    "RelevantInfo": "This file contains 9 sets of sanitized user data drawn from the\r\ncommand histories of 8 UNIX computer users at Purdue over the course\r\nof up to 2 years (USER0 and USER1 were generated by the same person,\r\nworking on different platforms and different projects).  The data is\r\ndrawn from tcsh(1) history files and has been parsed and sanitized to\r\nremove filenames, user names, directory structures, web addresses,\r\nhost names, and other possibly identifying items.  Command names,\r\nflags, and shell metacharacters have been preserved.  Additionally,\r\n**SOF** and **EOF** tokens have been inserted at the start and end of\r\nshell sessions, respectively.  Sessions are concatenated by date order\r\nand tokens appear in the order issued within the shell session, but no\r\ntimestamps are included in this data.  For example, the two sessions:\r\n<pre>\r\n\t# Start session 1\r\n\tcd ~/private/docs\r\n\tls -laF | more\r\n\tcat foo.txt bar.txt zorch.txt > somewhere\r\n\texit\r\n\t# End session 1\r\n\r\n\t# Start session 2\r\n\tcd ~/games/\r\n\txquake &\r\n\tfg\r\n\tvi scores.txt\r\n\tmailx john_doe@somewhere.com\r\n\texit\r\n\t# End session 2\r\n\t</pre>\r\nwould be represented by the token stream\r\n\t<pre>\r\n\t**SOF**\r\n\tcd\r\n\t<1>\t\t\t# one \"file name\" argument\r\n\tls\r\n\t-laF\r\n\t|\r\n\tmore\r\n\tcat\r\n\t<3>\t\t\t# three \"file\" arguments\r\n\t>\r\n\t<1>\r\n\texit\r\n\t**EOF**\r\n\t**SOF**\r\n\tcd\r\n\t<1>\r\n\txquake\r\n\t&\r\n\tfg\r\n\tvi\r\n\t<1>\r\n\tmailx\r\n\t<1>\r\n\texit\r\n\t**EOF**\r\n</pre>",
    "Source": "Terran Lane:\r\nterran@ecn.purdue.edu",
    "Acknowledgements": "This data is made available under conditions of anonymity for the contributing users and may be used for research purposes only. Summaries and research results employing this data may be published, but literal tokens or token sequences from the data may not be published except with express consent of the originators of the data. No portion of this data may be released with or included in a commercial product, nor may any portion of this data be sold or redistributed for profit or as part of of a profit-making endeavor.",
    "Area": "Computer",
    "RelevantPapers": "",
    "AttributeInfo": "",
    "FormatType": "",
    "NumHits": 5902
}