{
    "ID": 146,
    "Name": "Statlog (Landsat Satellite)",
    "Abstract": "Multi-spectral values of pixels in 3x3 neighbourhoods in a satellite image, and the classification associated with the central pixel in each neighbourhood",
    "Types": "Multivariate",
    "Task": "Classification",
    "AttributeTypes": "Integer",
    "NumInstances": 6435,
    "NumAttributes": 36,
    "DateDonated": "1993-02-13",
    "MissingValues": 0,
    "URLFolder": "../machine-learning-databases/statlog/satimage/",
    "URLReadme": "../machine-learning-databases/statlog/satimage/sat.doc",
    "HighestAccuracy": 0,
    "RelevantInfo": "The database consists of the multi-spectral values of pixels in 3x3 neighbourhoods in a satellite image, and the classification associated with the central pixel in each neighbourhood. The aim is to predict this classification, given the multi-spectral values. In the sample database, the class of a pixel is coded as a number.\r\n\r\nThe Landsat satellite data is one of the many sources of information available for a scene. The interpretation of a scene by integrating spatial data of diverse types and resolutions including multispectral and radar data, maps indicating topography, land use etc. is expected to assume significant importance with the onset of an era characterised by integrative approaches to remote sensing (for example, NASA's Earth Observing System commencing this decade). Existing statistical methods are ill-equipped for handling such diverse data types. Note that this is not true for Landsat MSS data considered in isolation (as in this sample database). This data satisfies the important requirements of being numerical and at a single resolution, and standard maximum-likelihood classification performs very well. Consequently, for this data, it should be interesting to compare the performance of other methods against the statistical approach.\r\n\r\nOne frame of Landsat MSS imagery consists of four digital images of the same scene in different spectral bands. Two of these are in the visible region (corresponding approximately to green and red regions of the visible spectrum) and two are in the (near) infra-red. Each pixel is a 8-bit binary word, with 0 corresponding to black and 255 to white. The spatial resolution of a pixel is about 80m x 80m. Each image contains 2340 x 3380 such pixels.\r\n\r\nThe database is a (tiny) sub-area of a scene, consisting of 82 x 100 pixels. Each line of data corresponds to a 3x3 square neighbourhood of pixels completely contained within the 82x100 sub-area. Each line contains the pixel values in the four spectral bands (converted to ASCII) of each of the 9 pixels in the 3x3 neighbourhood and a number indicating the classification label of the central pixel. The number is a code for the following classes:\r\n\r\nNumber\t\t\tClass\r\n1\t\t\tred soil\r\n2\t\t\tcotton crop\r\n3\t\t\tgrey soil\r\n4\t\t\tdamp grey soil\r\n5\t\t\tsoil with vegetation stubble\r\n6\t\t\tmixture class (all types present)\r\n7\t\t\tvery damp grey soil\r\n\t\r\nNB. There are no examples with class 6 in this dataset.\r\n\r\nThe data is given in random order and certain lines of data have been removed so you cannot reconstruct the original image from this dataset.\r\n\r\nIn each line of data the four spectral values for the top-left pixel are given first followed by the four spectral values for the top-middle pixel and then those for the top-right pixel, and so on with the pixels read out in sequence left-to-right and top-to-bottom. Thus, the four spectral values for the central pixel are given by attributes 17,18,19 and 20. If you like you can use only these four attributes, while ignoring the others. This avoids the problem which arises when a 3x3 neighbourhood straddles a boundary.\r\n",
    "Source": "    Ashwin Srinivasan\r\n     Department of Statistics and Data Modeling\r\n     University of Strathclyde\r\n     Glasgow\r\n     Scotland\r\n     UK\r\n     ross@uk.ac.turing\r\n\r\n\tThe original Landsat data for this database was generated\r\n\tfrom data purchased from NASA by the Australian Centre\r\n\tfor Remote Sensing, and used for research at:\r\n\t\tThe Centre for Remote Sensing\r\n\t\tUniversity of New South Wales\r\n\t\tKensington, PO Box 1\r\n\t\tNSW 2033\r\n\t\tAustralia.\r\n\r\n     The sample database was generated taking a small section (82\r\n     rows and 100 columns) from the original data. The binary values\r\n     were converted to their present ASCII form by Ashwin Srinivasan.\r\n     The classification for each pixel was performed on the basis of\r\n     an actual site visit by Ms. Karen Hall, when working for Professor\r\n     John A. Richards, at the Centre for Remote Sensing at the University\r\n     of New South Wales, Australia. Conversion to 3x3 neighbourhoods and\r\n     splitting into test and training sets was done by Alistair Sutherland.\r\n",
    "Acknowledgements": "",
    "Area": "Physical",
    "RelevantPapers": "",
    "AttributeInfo": "The attributes are numerical, in the range 0 to 255.",
    "FormatType": "Dense-Matrix",
    "NumHits": 15529
}