{
    "ID": 183,
    "Name": "Communities and Crime",
    "Abstract": "Communities within the United States. The data combines socio-economic data from the 1990 US Census, law enforcement data from the 1990 US LEMAS survey, and crime data from the 1995 FBI UCR.",
    "Types": "Multivariate",
    "Task": "Regression",
    "AttributeTypes": "Real",
    "NumInstances": 1994,
    "NumAttributes": 128,
    "DateDonated": "2009-07-13",
    "MissingValues": 1,
    "URLFolder": "../machine-learning-databases/communities/",
    "URLReadme": "../machine-learning-databases/communities/communities.names",
    "HighestAccuracy": 0,
    "RelevantInfo": "  Many variables are included so that algorithms that select or learn weights for attributes could be tested. However, clearly unrelated attributes were not included; attributes were picked if there was any plausible connection to crime (N=122), plus the attribute to be predicted (Per Capita Violent Crimes). The variables included in the dataset involve the community, such as the percent of the population considered urban, and the median family income, and involving law enforcement, such as per capita number of police officers, and percent of officers assigned to drug units. \r\n \r\n The per capita violent crimes variable was calculated using population and the sum of crime variables considered violent crimes in the United States: murder, rape, robbery, and assault. There was apparently some controversy in some states concerning the counting of rapes. These resulted in missing values for rape, which resulted in incorrect values for per capita violent crime. These cities are not included in the dataset. Many of these omitted communities were from the midwestern USA.\r\n\r\n  Data is described below based on original values. All numeric data was normalized into the decimal range  0.00-1.00 using an Unsupervised, equal-interval binning method. Attributes retain their distribution and skew (hence for example the population attribute has a mean value of  0.06 because most communities are small). E.g. An attribute described as 'mean people per household' is actually the normalized (0-1) version of that value.\r\n\r\n  The normalization preserves rough ratios of values WITHIN an attribute (e.g. double the value for double the population within the available precision - except for extreme values (all values more than 3 SD above the mean are normalized to 1.00; all values more than 3 SD below the mean are nromalized to  0.00)).\r\n\r\n  However, the normalization does not preserve relationships between values BETWEEN attributes (e.g. it would not be meaningful to compare the value for whitePerCap with the value for blackPerCap for a community)\r\n\r\n  A limitation was that the LEMAS survey was of the police departments with at least 100 officers, plus a random sample of smaller departments. For our purposes, communities not found in both census and crime datasets were omitted. Many communities are missing LEMAS data.\r\n\r\n.arff header for Weka:\r\n\r\n@relation crimepredict\r\n\r\n@attribute state numeric\r\n@attribute county numeric\r\n@attribute community numeric\r\n@attribute communityname string\r\n@attribute fold numeric\r\n@attribute population numeric\r\n@attribute householdsize numeric\r\n@attribute racepctblack numeric\r\n@attribute racePctWhite numeric\r\n@attribute racePctAsian numeric\r\n@attribute racePctHisp numeric\r\n@attribute agePct12t21 numeric\r\n@attribute agePct12t29 numeric\r\n@attribute agePct16t24 numeric\r\n@attribute agePct65up numeric\r\n@attribute numbUrban numeric\r\n@attribute pctUrban numeric\r\n@attribute medIncome numeric\r\n@attribute pctWWage numeric\r\n@attribute pctWFarmSelf numeric\r\n@attribute pctWInvInc numeric\r\n@attribute pctWSocSec numeric\r\n@attribute pctWPubAsst numeric\r\n@attribute pctWRetire numeric\r\n@attribute medFamInc numeric\r\n@attribute perCapInc numeric\r\n@attribute whitePerCap numeric\r\n@attribute blackPerCap numeric\r\n@attribute indianPerCap numeric\r\n@attribute AsianPerCap numeric\r\n@attribute OtherPerCap numeric\r\n@attribute HispPerCap numeric\r\n@attribute NumUnderPov numeric\r\n@attribute PctPopUnderPov numeric\r\n@attribute PctLess9thGrade numeric\r\n@attribute PctNotHSGrad numeric\r\n@attribute PctBSorMore numeric\r\n@attribute PctUnemployed numeric\r\n@attribute PctEmploy numeric\r\n@attribute PctEmplManu numeric\r\n@attribute PctEmplProfServ numeric\r\n@attribute PctOccupManu numeric\r\n@attribute PctOccupMgmtProf numeric\r\n@attribute MalePctDivorce numeric\r\n@attribute MalePctNevMarr numeric\r\n@attribute FemalePctDiv numeric\r\n@attribute TotalPctDiv numeric\r\n@attribute PersPerFam numeric\r\n@attribute PctFam2Par numeric\r\n@attribute PctKids2Par numeric\r\n@attribute PctYoungKids2Par numeric\r\n@attribute PctTeen2Par numeric\r\n@attribute PctWorkMomYoungKids numeric\r\n@attribute PctWorkMom numeric\r\n@attribute NumIlleg numeric\r\n@attribute PctIlleg numeric\r\n@attribute NumImmig numeric\r\n@attribute PctImmigRecent numeric\r\n@attribute PctImmigRec5 numeric\r\n@attribute PctImmigRec8 numeric\r\n@attribute PctImmigRec10 numeric\r\n@attribute PctRecentImmig numeric\r\n@attribute PctRecImmig5 numeric\r\n@attribute PctRecImmig8 numeric\r\n@attribute PctRecImmig10 numeric\r\n@attribute PctSpeakEnglOnly numeric\r\n@attribute PctNotSpeakEnglWell numeric\r\n@attribute PctLargHouseFam numeric\r\n@attribute PctLargHouseOccup numeric\r\n@attribute PersPerOccupHous numeric\r\n@attribute PersPerOwnOccHous numeric\r\n@attribute PersPerRentOccHous numeric\r\n@attribute PctPersOwnOccup numeric\r\n@attribute PctPersDenseHous numeric\r\n@attribute PctHousLess3BR numeric\r\n@attribute MedNumBR numeric\r\n@attribute HousVacant numeric\r\n@attribute PctHousOccup numeric\r\n@attribute PctHousOwnOcc numeric\r\n@attribute PctVacantBoarded numeric\r\n@attribute PctVacMore6Mos numeric\r\n@attribute MedYrHousBuilt numeric\r\n@attribute PctHousNoPhone numeric\r\n@attribute PctWOFullPlumb numeric\r\n@attribute OwnOccLowQuart numeric\r\n@attribute OwnOccMedVal numeric\r\n@attribute OwnOccHiQuart numeric\r\n@attribute RentLowQ numeric\r\n@attribute RentMedian numeric\r\n@attribute RentHighQ numeric\r\n@attribute MedRent numeric\r\n@attribute MedRentPctHousInc numeric\r\n@attribute MedOwnCostPctInc numeric\r\n@attribute MedOwnCostPctIncNoMtg numeric\r\n@attribute NumInShelters numeric\r\n@attribute NumStreet numeric\r\n@attribute PctForeignBorn numeric\r\n@attribute PctBornSameState numeric\r\n@attribute PctSameHouse85 numeric\r\n@attribute PctSameCity85 numeric\r\n@attribute PctSameState85 numeric\r\n@attribute LemasSwornFT numeric\r\n@attribute LemasSwFTPerPop numeric\r\n@attribute LemasSwFTFieldOps numeric\r\n@attribute LemasSwFTFieldPerPop numeric\r\n@attribute LemasTotalReq numeric\r\n@attribute LemasTotReqPerPop numeric\r\n@attribute PolicReqPerOffic numeric\r\n@attribute PolicPerPop numeric\r\n@attribute RacialMatchCommPol numeric\r\n@attribute PctPolicWhite numeric\r\n@attribute PctPolicBlack numeric\r\n@attribute PctPolicHisp numeric\r\n@attribute PctPolicAsian numeric\r\n@attribute PctPolicMinor numeric\r\n@attribute OfficAssgnDrugUnits numeric\r\n@attribute NumKindsDrugsSeiz numeric\r\n@attribute PolicAveOTWorked numeric\r\n@attribute LandArea numeric\r\n@attribute PopDens numeric\r\n@attribute PctUsePubTrans numeric\r\n@attribute PolicCars numeric\r\n@attribute PolicOperBudg numeric\r\n@attribute LemasPctPolicOnPatr numeric\r\n@attribute LemasGangUnitDeploy numeric\r\n@attribute LemasPctOfficDrugUn numeric\r\n@attribute PolicBudgPerPop numeric\r\n@attribute ViolentCrimesPerPop numeric\r\n\r\n@data\r\n\r\n  ",
    "Source": "Creator: Michael Redmond (redmond@lasalle.edu); Computer Science; La Salle University; Philadelphia, PA, 19141, USA\r\n    -- culled from 1990 US Census, 1995 US FBI Uniform Crime Report, 1990 US Law Enforcement Management and Administrative Statistics Survey, available from ICPSR at U of Michigan.\r\n  -- Donor: Michael Redmond (redmond@lasalle.edu); Computer Science; La Salle University; Philadelphia, PA, 19141, USA\r\n  -- Date: July 2009",
    "Acknowledgements": "  Please cite the UCI Machine Learning Repository, my sources and my related paper:\r\n\r\n  U. S. Department of Commerce, Bureau of the Census, Census Of Population And Housing 1990 United States: Summary Tape File 1a & 3a (Computer Files), \r\n\r\n  U.S. Department Of Commerce, Bureau Of The Census Producer, Washington, DC and Inter-university Consortium for Political and Social Research Ann Arbor, Michigan. (1992) \r\n\r\n  U.S. Department of Justice, Bureau of Justice Statistics, Law Enforcement Management And Administrative Statistics (Computer File) U.S. Department Of Commerce, Bureau Of The Census Producer, Washington, DC and Inter-university Consortium for Political and Social Research Ann Arbor, Michigan. (1992) \r\n\r\n  U.S. Department of Justice, Federal Bureau of Investigation, Crime in the United States (Computer File) (1995) \r\n\r\n  Redmond, M. A. and A. Baveja: A Data-Driven Software Tool for Enabling Cooperative Information Sharing Among Police Departments. European Journal of Operational Research 141 (2002) 660-678. ",
    "Area": "Social",
    "RelevantPapers": "  No published results using this specific dataset. \r\n\r\n  Related dataset used in Redmond and Baveja 'A data-driven software tool for enabling cooperative information sharing among police departments' in European Journal of Operational Research 141 (2002) 660-678; \r\n  That article includes a description of the integration of the three sources of data, however, this data is normalized differently and more/different attributes are included.\r\n",
    "AttributeInfo": "Attribute Information: (122 predictive, 5 non-predictive, 1 goal)\r\n  -- state: US state (by number) - not counted as predictive above, but if considered, should be consided nominal (nominal) \r\n  -- county: numeric code for county - not predictive, and many missing values (numeric)\r\n  -- community: numeric code for community - not predictive and many missing values (numeric)\r\n  -- communityname: community name - not predictive - for information only (string)\r\n  -- fold: fold number for non-random 10 fold cross validation, potentially useful for debugging, paired tests - not predictive (numeric)\r\n  -- population: population for community: (numeric - decimal)\r\n  -- householdsize: mean people per household (numeric - decimal)\r\n  -- racepctblack: percentage of population that is african american (numeric - decimal)\r\n  -- racePctWhite: percentage of population that is caucasian (numeric - decimal)\r\n  -- racePctAsian: percentage of population that is of asian heritage (numeric - decimal)\r\n  -- racePctHisp: percentage of population that is of hispanic heritage (numeric - decimal)\r\n  -- agePct12t21: percentage of population that is 12-21 in age (numeric - decimal)\r\n  -- agePct12t29: percentage of population that is 12-29 in age (numeric - decimal)\r\n  -- agePct16t24: percentage of population that is 16-24 in age (numeric - decimal)\r\n  -- agePct65up: percentage of population that is 65 and over in age (numeric - decimal)\r\n  -- numbUrban: number of people living in areas classified as urban (numeric - decimal)\r\n  -- pctUrban: percentage of people living in areas classified as urban (numeric - decimal)\r\n  -- medIncome: median household income (numeric - decimal)\r\n  -- pctWWage: percentage of households with wage or salary income in 1989 (numeric - decimal)\r\n  -- pctWFarmSelf: percentage of households with farm or self employment income in 1989 (numeric - decimal)\r\n  -- pctWInvInc: percentage of households with investment / rent income in 1989 (numeric - decimal)\r\n  -- pctWSocSec: percentage of households with social security income in 1989 (numeric - decimal)\r\n  -- pctWPubAsst: percentage of households with public assistance income in 1989 (numeric - decimal)\r\n  -- pctWRetire: percentage of households with retirement income in 1989 (numeric - decimal)\r\n  -- medFamInc: median family income (differs from household income for non-family households) (numeric - decimal)\r\n  -- perCapInc: per capita income (numeric - decimal)\r\n  -- whitePerCap: per capita income for caucasians (numeric - decimal)\r\n  -- blackPerCap: per capita income for african americans (numeric - decimal)\r\n  -- indianPerCap: per capita income for native americans (numeric - decimal)\r\n  -- AsianPerCap: per capita income for people with asian heritage (numeric - decimal)\r\n  -- OtherPerCap: per capita income for people with 'other' heritage (numeric - decimal)\r\n  -- HispPerCap: per capita income for people with hispanic heritage (numeric - decimal)\r\n  -- NumUnderPov: number of people under the poverty level (numeric - decimal)\r\n  -- PctPopUnderPov: percentage of people under the poverty level (numeric - decimal)\r\n  -- PctLess9thGrade: percentage of people 25 and over with less than a 9th grade education (numeric - decimal)\r\n  -- PctNotHSGrad: percentage of people 25 and over that are not high school graduates (numeric - decimal)\r\n  -- PctBSorMore: percentage of people 25 and over with a bachelors degree or higher education (numeric - decimal)\r\n  -- PctUnemployed: percentage of people 16 and over, in the labor force, and unemployed (numeric - decimal)\r\n  -- PctEmploy: percentage of people 16 and over who are employed (numeric - decimal)\r\n  -- PctEmplManu: percentage of people 16 and over who are employed in manufacturing (numeric - decimal)\r\n  -- PctEmplProfServ: percentage of people 16 and over who are employed in professional services (numeric - decimal)\r\n  -- PctOccupManu: percentage of people 16 and over who are employed in manufacturing (numeric - decimal)   ########\r\n  -- PctOccupMgmtProf: percentage of people 16 and over who are employed in management or professional occupations (numeric - decimal)\r\n  -- MalePctDivorce: percentage of males who are divorced (numeric - decimal)\r\n  -- MalePctNevMarr: percentage of males who have never married (numeric - decimal)\r\n  -- FemalePctDiv: percentage of females who are divorced (numeric - decimal)\r\n  -- TotalPctDiv: percentage of population who are divorced (numeric - decimal)\r\n  -- PersPerFam: mean number of people per family (numeric - decimal)\r\n  -- PctFam2Par: percentage of families (with kids) that are headed by two parents (numeric - decimal)\r\n  -- PctKids2Par: percentage of kids in family housing with two parents (numeric - decimal)\r\n  -- PctYoungKids2Par: percent of kids 4 and under in two parent households (numeric - decimal)\r\n  -- PctTeen2Par: percent of kids age 12-17 in two parent households (numeric - decimal)\r\n  -- PctWorkMomYoungKids: percentage of moms of kids 6 and under in labor force (numeric - decimal)\r\n  -- PctWorkMom: percentage of moms of kids under 18 in labor force (numeric - decimal)\r\n  -- NumIlleg: number of kids born to never married (numeric - decimal)\r\n  -- PctIlleg: percentage of kids born to never married (numeric - decimal)\r\n  -- NumImmig: total number of people known to be foreign born (numeric - decimal)\r\n  -- PctImmigRecent: percentage of _immigrants_ who immigated within last 3 years (numeric - decimal)\r\n  -- PctImmigRec5: percentage of _immigrants_ who immigated within last 5 years (numeric - decimal)\r\n  -- PctImmigRec8: percentage of _immigrants_ who immigated within last 8 years (numeric - decimal)\r\n  -- PctImmigRec10: percentage of _immigrants_ who immigated within last 10 years (numeric - decimal)\r\n  -- PctRecentImmig: percent of _population_ who have immigrated within the last 3 years (numeric - decimal)\r\n  -- PctRecImmig5: percent of _population_ who have immigrated within the last 5 years (numeric - decimal)\r\n  -- PctRecImmig8: percent of _population_ who have immigrated within the last 8 years (numeric - decimal)\r\n  -- PctRecImmig10: percent of _population_ who have immigrated within the last 10 years (numeric - decimal)\r\n  -- PctSpeakEnglOnly: percent of people who speak only English (numeric - decimal)\r\n  -- PctNotSpeakEnglWell: percent of people who do not speak English well (numeric - decimal)\r\n  -- PctLargHouseFam: percent of family households that are large (6 or more) (numeric - decimal)\r\n  -- PctLargHouseOccup: percent of all occupied households that are large (6 or more people) (numeric - decimal)\r\n  -- PersPerOccupHous: mean persons per household (numeric - decimal)\r\n  -- PersPerOwnOccHous: mean persons per owner occupied household (numeric - decimal)\r\n  -- PersPerRentOccHous: mean persons per rental household (numeric - decimal)\r\n  -- PctPersOwnOccup: percent of people in owner occupied households (numeric - decimal)\r\n  -- PctPersDenseHous: percent of persons in dense housing (more than 1 person per room) (numeric - decimal)\r\n  -- PctHousLess3BR: percent of housing units with less than 3 bedrooms (numeric - decimal)\r\n  -- MedNumBR: median number of bedrooms (numeric - decimal)\r\n  -- HousVacant: number of vacant households (numeric - decimal)\r\n  -- PctHousOccup: percent of housing occupied (numeric - decimal)\r\n  -- PctHousOwnOcc: percent of households owner occupied (numeric - decimal)\r\n  -- PctVacantBoarded: percent of vacant housing that is boarded up (numeric - decimal)\r\n  -- PctVacMore6Mos: percent of vacant housing that has been vacant more than 6 months (numeric - decimal)\r\n  -- MedYrHousBuilt: median year housing units built (numeric - decimal)\r\n  -- PctHousNoPhone: percent of occupied housing units without phone (in 1990, this was rare!) (numeric - decimal)\r\n  -- PctWOFullPlumb: percent of housing without complete plumbing facilities (numeric - decimal)\r\n  -- OwnOccLowQuart: owner occupied housing - lower quartile value (numeric - decimal)\r\n  -- OwnOccMedVal: owner occupied housing - median value (numeric - decimal)\r\n  -- OwnOccHiQuart: owner occupied housing - upper quartile value (numeric - decimal)\r\n  -- RentLowQ: rental housing - lower quartile rent (numeric - decimal)\r\n  -- RentMedian: rental housing - median rent (Census variable H32B from file STF1A) (numeric - decimal)\r\n  -- RentHighQ: rental housing - upper quartile rent (numeric - decimal)\r\n  -- MedRent: median gross rent (Census variable H43A from file STF3A - includes utilities) (numeric - decimal)\r\n  -- MedRentPctHousInc: median gross rent as a percentage of household income (numeric - decimal)\r\n  -- MedOwnCostPctInc: median owners cost as a percentage of household income - for owners with a mortgage (numeric - decimal)\r\n  -- MedOwnCostPctIncNoMtg: median owners cost as a percentage of household income - for owners without a mortgage (numeric - decimal)\r\n  -- NumInShelters: number of people in homeless shelters (numeric - decimal)\r\n  -- NumStreet: number of homeless people counted in the street (numeric - decimal)\r\n  -- PctForeignBorn: percent of people foreign born (numeric - decimal)\r\n  -- PctBornSameState: percent of people born in the same state as currently living (numeric - decimal)\r\n  -- PctSameHouse85: percent of people living in the same house as in 1985 (5 years before) (numeric - decimal)\r\n  -- PctSameCity85: percent of people living in the same city as in 1985 (5 years before) (numeric - decimal)\r\n  -- PctSameState85: percent of people living in the same state as in 1985 (5 years before) (numeric - decimal)\r\n  -- LemasSwornFT: number of sworn full time police officers (numeric - decimal)\r\n  -- LemasSwFTPerPop: sworn full time police officers per 100K population (numeric - decimal)\r\n  -- LemasSwFTFieldOps: number of sworn full time police officers in field operations (on the street as opposed to administrative etc) (numeric - decimal)\r\n  -- LemasSwFTFieldPerPop: sworn full time police officers in field operations (on the street as opposed to administrative etc) per 100K population (numeric - decimal)\r\n  -- LemasTotalReq: total requests for police (numeric - decimal)\r\n  -- LemasTotReqPerPop: total requests for police per 100K popuation (numeric - decimal)\r\n  -- PolicReqPerOffic: total requests for police per police officer (numeric - decimal)\r\n  -- PolicPerPop: police officers per 100K population (numeric - decimal)\r\n  -- RacialMatchCommPol: a measure of the racial match between the community and the police force. High values indicate proportions in community and police force are similar (numeric - decimal)\r\n  -- PctPolicWhite: percent of police that are caucasian (numeric - decimal)\r\n  -- PctPolicBlack: percent of police that are african american (numeric - decimal)\r\n  -- PctPolicHisp: percent of police that are hispanic (numeric - decimal)\r\n  -- PctPolicAsian: percent of police that are asian (numeric - decimal)\r\n  -- PctPolicMinor: percent of police that are minority of any kind (numeric - decimal)\r\n  -- OfficAssgnDrugUnits: number of officers assigned to special drug units (numeric - decimal)\r\n  -- NumKindsDrugsSeiz: number of different kinds of drugs seized (numeric - decimal)\r\n  -- PolicAveOTWorked: police average overtime worked (numeric - decimal)\r\n  -- LandArea: land area in square miles (numeric - decimal)\r\n  -- PopDens: population density in persons per square mile (numeric - decimal)\r\n  -- PctUsePubTrans: percent of people using public transit for commuting (numeric - decimal)\r\n  -- PolicCars: number of police cars (numeric - decimal)\r\n  -- PolicOperBudg: police operating budget (numeric - decimal)\r\n  -- LemasPctPolicOnPatr: percent of sworn full time police officers on patrol (numeric - decimal)\r\n  -- LemasGangUnitDeploy: gang unit deployed (numeric - decimal - but really ordinal - 0 means NO, 1 means YES,  0.5 means Part Time)\r\n  -- LemasPctOfficDrugUn: percent of officers assigned to drug units (numeric - decimal)\r\n  -- PolicBudgPerPop: police operating budget per population (numeric - decimal)\r\n  -- ViolentCrimesPerPop: total number of violent crimes per 100K popuation (numeric - decimal) GOAL attribute (to be predicted)\r\n\r\nSummary Statistics:\r\n\t\t\tMin\tMax\t Mean\t SD\tCorrel\tMedian\t Mode\tMissing\r\npopulation\t\t0\t1\t 0.06\t 0.13\t 0.37\t 0.02\t 0.01\t0\r\nhouseholdsize\t\t0\t1\t 0.46\t 0.16\t-0.03\t 0.44\t 0.41\t0\r\nracepctblack\t\t0\t1\t 0.18\t 0.25\t 0.63\t 0.06\t 0.01\t0\r\nracePctWhite\t\t0\t1\t 0.75\t 0.24\t-0.68\t 0.85\t 0.98\t0\r\nracePctAsian\t\t0\t1\t 0.15\t 0.21\t 0.04\t 0.07\t 0.02\t0\r\nracePctHisp\t\t0\t1\t 0.14\t 0.23\t 0.29\t 0.04\t 0.01\t0\r\nagePct12t21\t\t0\t1\t 0.42\t 0.16\t 0.06\t 0.4\t 0.38\t0\r\nagePct12t29\t\t0\t1\t 0.49\t 0.14\t 0.15\t 0.48\t 0.49\t0\r\nagePct16t24\t\t0\t1\t 0.34\t 0.17\t 0.10\t 0.29\t 0.29\t0\r\nagePct65up\t\t0\t1\t 0.42\t 0.18\t 0.07\t 0.42\t 0.47\t0\r\nnumbUrban\t\t0\t1\t 0.06\t 0.13\t 0.36\t 0.03\t 0\t0\r\npctUrban\t\t0\t1\t 0.70\t 0.44\t 0.08\t 1\t 1\t0\r\nmedIncome\t\t0\t1\t 0.36\t 0.21\t-0.42\t 0.32\t 0.23\t0\r\npctWWage\t\t0\t1\t 0.56\t 0.18\t-0.31\t 0.56\t 0.58\t0\r\npctWFarmSelf\t\t0\t1\t 0.29\t 0.20\t-0.15\t 0.23\t 0.16\t0\r\npctWInvInc\t\t0\t1\t 0.50\t 0.18\t-0.58\t 0.48\t 0.41\t0\r\npctWSocSec\t\t0\t1\t 0.47\t 0.17\t 0.12\t 0.475\t 0.56\t0\r\npctWPubAsst\t\t0\t1\t 0.32\t 0.22\t 0.57\t 0.26\t 0.1\t0\r\npctWRetire\t\t0\t1\t 0.48\t 0.17\t-0.10\t 0.47\t 0.44\t0\r\nmedFamInc\t\t0\t1\t 0.38\t 0.20\t-0.44\t 0.33\t 0.25\t0\r\nperCapInc\t\t0\t1\t 0.35\t 0.19\t-0.35\t 0.3\t 0.23\t0\r\nwhitePerCap\t\t0\t1\t 0.37\t 0.19\t-0.21\t 0.32\t 0.3\t0\r\nblackPerCap\t\t0\t1\t 0.29\t 0.17\t-0.28\t 0.25\t 0.18\t0\r\nindianPerCap\t\t0\t1\t 0.20\t 0.16\t-0.09\t 0.17\t 0\t0\r\nAsianPerCap\t\t0\t1\t 0.32\t 0.20\t-0.16\t 0.28\t 0.18\t0\r\nOtherPerCap\t\t0\t1\t 0.28\t 0.19\t-0.13\t 0.25\t 0\t1\r\nHispPerCap\t\t0\t1\t 0.39\t 0.18\t-0.24\t 0.345\t 0.3\t0\r\nNumUnderPov\t\t0\t1\t 0.06\t 0.13\t 0.45\t 0.02\t 0.01\t0\r\nPctPopUnderPov\t\t0\t1\t 0.30\t 0.23\t 0.52\t 0.25\t 0.08\t0\r\nPctLess9thGrade\t\t0\t1\t 0.32\t 0.21\t 0.41\t 0.27\t 0.19\t0\r\nPctNotHSGrad\t\t0\t1\t 0.38\t 0.20\t 0.48\t 0.36\t 0.39\t0\r\nPctBSorMore\t\t0\t1\t 0.36\t 0.21\t-0.31\t 0.31\t 0.18\t0\r\nPctUnemployed\t\t0\t1\t 0.36\t 0.20\t 0.50\t 0.32\t 0.24\t0\r\nPctEmploy\t\t0\t1\t 0.50\t 0.17\t-0.33\t 0.51\t 0.56\t0\r\nPctEmplManu\t\t0\t1\t 0.40\t 0.20\t-0.04\t 0.37\t 0.26\t0\r\nPctEmplProfServ\t\t0\t1\t 0.44\t 0.18\t-0.07\t 0.41\t 0.36\t0\r\nPctOccupManu\t\t0\t1\t 0.39\t 0.20\t 0.30\t 0.37\t 0.32\t0\r\nPctOccupMgmtProf\t0\t1\t 0.44\t 0.19\t-0.34\t 0.4\t 0.36\t0\r\nMalePctDivorce\t\t0\t1\t 0.46\t 0.18\t 0.53\t 0.47\t 0.56\t0\r\nMalePctNevMarr\t\t0\t1\t 0.43\t 0.18\t 0.30\t 0.4\t 0.38\t0\r\nFemalePctDiv\t\t0\t1\t 0.49\t 0.18\t 0.56\t 0.5\t 0.54\t0\r\nTotalPctDiv\t\t0\t1\t 0.49\t 0.18\t 0.55\t 0.5\t 0.57\t0\r\nPersPerFam\t\t0\t1\t 0.49\t 0.15\t 0.14\t 0.47\t 0.44\t0\r\nPctFam2Par\t\t0\t1\t 0.61\t 0.20\t-0.71\t 0.63\t 0.7\t0\r\nPctKids2Par\t\t0\t1\t 0.62\t 0.21\t-0.74\t 0.64\t 0.72\t0\r\nPctYoungKids2Par\t0\t1\t 0.66\t 0.22\t-0.67\t 0.7\t 0.91\t0\r\nPctTeen2Par\t\t0\t1\t 0.58\t 0.19\t-0.66\t 0.61\t 0.6\t0\r\nPctWorkMomYoungKids\t0\t1\t 0.50\t 0.17\t-0.02\t 0.51\t 0.51\t0\r\nPctWorkMom\t\t0\t1\t 0.53\t 0.18\t-0.15\t 0.54\t 0.57\t0\r\nNumIlleg\t\t0\t1\t 0.04\t 0.11\t 0.47\t 0.01\t 0\t0\r\nPctIlleg\t\t0\t1\t 0.25\t 0.23\t 0.74\t 0.17\t 0.09\t0\r\nNumImmig\t\t0\t1\t 0.03\t 0.09\t 0.29\t 0.01\t 0\t0\r\nPctImmigRecent\t\t0\t1\t 0.32\t 0.22\t 0.17\t 0.29\t 0\t0\r\nPctImmigRec5\t\t0\t1\t 0.36\t 0.21\t 0.22\t 0.34\t 0\t0\r\nPctImmigRec8\t\t0\t1\t 0.40\t 0.20\t 0.25\t 0.39\t 0.26\t0\r\nPctImmigRec10\t\t0\t1\t 0.43\t 0.19\t 0.29\t 0.43\t 0.43\t0\r\nPctRecentImmig\t\t0\t1\t 0.18\t 0.24\t 0.23\t 0.09\t 0.01\t0\r\nPctRecImmig5\t\t0\t1\t 0.18\t 0.24\t 0.25\t 0.08\t 0.02\t0\r\nPctRecImmig8\t\t0\t1\t 0.18\t 0.24\t 0.25\t 0.09\t 0.02\t0\r\nPctRecImmig10\t\t0\t1\t 0.18\t 0.23\t 0.26\t 0.09\t 0.02\t0\r\nPctSpeakEnglOnly\t0\t1\t 0.79\t 0.23\t-0.24\t 0.87\t 0.96\t0\r\nPctNotSpeakEnglWell\t0\t1\t 0.15\t 0.22\t 0.30\t 0.06\t 0.03\t0\r\nPctLargHouseFam\t\t0\t1\t 0.27\t 0.20\t 0.38\t 0.2\t 0.17\t0\r\nPctLargHouseOccup\t0\t1\t 0.25\t 0.19\t 0.29\t 0.19\t 0.19\t0\r\nPersPerOccupHous\t0\t1\t 0.46\t 0.17\t-0.04\t 0.44\t 0.37\t0\r\nPersPerOwnOccHous\t0\t1\t 0.49\t 0.16\t-0.12\t 0.48\t 0.45\t0\r\nPersPerRentOccHous\t0\t1\t 0.40\t 0.19\t 0.25\t 0.36\t 0.32\t0\r\nPctPersOwnOccup\t\t0\t1\t 0.56\t 0.20\t-0.53\t 0.56\t 0.54\t0\r\nPctPersDenseHous\t0\t1\t 0.19\t 0.21\t 0.45\t 0.11\t 0.06\t0\r\nPctHousLess3BR\t\t0\t1\t 0.50\t 0.17\t 0.47\t 0.51\t 0.53\t0\r\nMedNumBR\t\t0\t1\t 0.31\t 0.26\t-0.36\t 0.5\t 0.5\t0\r\nHousVacant\t\t0\t1\t 0.08\t 0.15\t 0.42\t 0.03\t 0.01\t0\r\nPctHousOccup\t\t0\t1\t 0.72\t 0.19\t-0.32\t 0.77\t 0.88\t0\r\nPctHousOwnOcc\t\t0\t1\t 0.55\t 0.19\t-0.47\t 0.54\t 0.52\t0\r\nPctVacantBoarded\t0\t1\t 0.20\t 0.22\t 0.48\t 0.13\t 0\t0\r\nPctVacMore6Mos\t\t0\t1\t 0.43\t 0.19\t 0.02\t 0.42\t 0.44\t0\r\nMedYrHousBuilt\t\t0\t1\t 0.49\t 0.23\t-0.11\t 0.52\t 0\t0\r\nPctHousNoPhone\t\t0\t1\t 0.26\t 0.24\t 0.49\t 0.185\t 0.01\t0\r\nPctWOFullPlumb\t\t0\t1\t 0.24\t 0.21\t 0.36\t 0.19\t 0\t0\r\nOwnOccLowQuart\t\t0\t1\t 0.26\t 0.22\t-0.21\t 0.18\t 0.09\t0\r\nOwnOccMedVal\t\t0\t1\t 0.26\t 0.23\t-0.19\t 0.17\t 0.08\t0\r\nOwnOccHiQuart\t\t0\t1\t 0.27\t 0.24\t-0.17\t 0.18\t 0.08\t0\r\nRentLowQ\t\t0\t1\t 0.35\t 0.22\t-0.25\t 0.31\t 0.13\t0\r\nRentMedian\t\t0\t1\t 0.37\t 0.21\t-0.24\t 0.33\t 0.19\t0\r\nRentHighQ\t\t0\t1\t 0.42\t 0.25\t-0.23\t 0.37\t 1\t0\r\nMedRent\t\t\t0\t1\t 0.38\t 0.21\t-0.24\t 0.34\t 0.17\t0\r\nMedRentPctHousInc\t0\t1\t 0.49\t 0.17\t 0.33\t 0.48\t 0.4\t0\r\nMedOwnCostPctInc\t0\t1\t 0.45\t 0.19\t 0.06\t 0.45\t 0.41\t0\r\nMedOwnCostPctIncNoMtg\t0\t1\t 0.40\t 0.19\t 0.05\t 0.37\t 0.24\t0\r\nNumInShelters\t\t0\t1\t 0.03\t 0.10\t 0.38\t 0\t 0\t0\r\nNumStreet\t\t0\t1\t 0.02\t 0.10\t 0.34\t 0\t 0\t0\r\nPctForeignBorn\t\t0\t1\t 0.22\t 0.23\t 0.19\t 0.13\t 0.03\t0\r\nPctBornSameState\t0\t1\t 0.61\t 0.20\t-0.08\t 0.63\t 0.78\t0\r\nPctSameHouse85\t\t0\t1\t 0.54\t 0.18\t-0.16\t 0.54\t 0.59\t0\r\nPctSameCity85\t\t0\t1\t 0.63\t 0.20\t 0.08\t 0.67\t 0.74\t0\r\nPctSameState85\t\t0\t1\t 0.65\t 0.20\t-0.02\t 0.7\t 0.79\t0\r\nLemasSwornFT\t\t0\t1\t 0.07\t 0.14\t 0.34\t 0.02\t 0.02\t1675\r\nLemasSwFTPerPop\t\t0\t1\t 0.22\t 0.16\t 0.15\t 0.18\t 0.2\t1675\r\nLemasSwFTFieldOps\t0\t1\t 0.92\t 0.13\t-0.33\t 0.97\t 0.98\t1675\r\nLemasSwFTFieldPerPop\t0\t1\t 0.25\t 0.16\t 0.16\t 0.21\t 0.19\t1675\r\nLemasTotalReq\t\t0\t1\t 0.10\t 0.16\t 0.35\t 0.04\t 0.02\t1675\r\nLemasTotReqPerPop\t0\t1\t 0.22\t 0.16\t 0.27\t 0.17\t 0.14\t1675\r\nPolicReqPerOffic\t0\t1\t 0.34\t 0.20\t 0.17\t 0.29\t 0.23\t1675\r\nPolicPerPop\t\t0\t1\t 0.22\t 0.16\t 0.15\t 0.18\t 0.2\t1675\r\nRacialMatchCommPol\t0\t1\t 0.69\t 0.23\t-0.46\t 0.74\t 0.78\t1675\r\nPctPolicWhite\t\t0\t1\t 0.73\t 0.22\t-0.44\t 0.78\t 0.72\t1675\r\nPctPolicBlack\t\t0\t1\t 0.22\t 0.24\t 0.54\t 0.12\t 0\t1675\r\nPctPolicHisp\t\t0\t1\t 0.13\t 0.20\t 0.12\t 0.06\t 0\t1675\r\nPctPolicAsian\t\t0\t1\t 0.11\t 0.23\t 0.10\t 0\t 0\t1675\r\nPctPolicMinor\t\t0\t1\t 0.26\t 0.23\t 0.49\t 0.2\t 0.07\t1675\r\nOfficAssgnDrugUnits\t0\t1\t 0.08\t 0.12\t 0.34\t 0.04\t 0.03\t1675\r\nNumKindsDrugsSeiz\t0\t1\t 0.56\t 0.20\t 0.13\t 0.57\t 0.57\t1675\r\nPolicAveOTWorked\t0\t1\t 0.31\t 0.23\t 0.03\t 0.26\t 0.19\t1675\r\nLandArea\t\t0\t1\t 0.07\t 0.11\t 0.20\t 0.04\t 0.01\t0\r\nPopDens\t\t\t0\t1\t 0.23\t 0.20\t 0.28\t 0.17\t 0.09\t0\r\nPctUsePubTrans\t\t0\t1\t 0.16\t 0.23\t 0.15\t 0.07\t 0.01\t0\r\nPolicCars\t\t0\t1\t 0.16\t 0.21\t 0.38\t 0.08\t 0.02\t1675\r\nPolicOperBudg\t\t0\t1\t 0.08\t 0.14\t 0.34\t 0.03\t 0.02\t1675\r\nLemasPctPolicOnPatr\t0\t1\t 0.70\t 0.21\t-0.08\t 0.75\t 0.74\t1675\r\nLemasGangUnitDeploy\t0\t1\t 0.44\t 0.41\t 0.12\t 0.5\t 0\t1675\r\nLemasPctOfficDrugUn\t0\t1\t 0.09\t 0.24\t 0.35\t 0\t 0\t0\r\nPolicBudgPerPop\t\t0\t1\t 0.20\t 0.16\t 0.10\t 0.15\t 0.12\t1675\r\nViolentCrimesPerPop\t0\t1\t 0.24\t 0.23\t 1.00\t 0.15\t 0.03\t0\r\n\r\nDistribution of the Goal Variable (Violent Crimes per Population):\r\n   Range\tFrequency\r\n0.000-0.067\t484\r\n0.067-0.133\t420\r\n0.133-0.200\t284\r\n0.200-0.267\t177\r\n0.267-0.333\t142\r\n0.333-0.400\t113\r\n0.400-0.467\t 59\r\n0.467-0.533\t 76\r\n0.533-0.600\t 57\r\n0.600-0.667\t 38\r\n0.667-0.733\t 37\r\n0.733-0.800\t 20\r\n0.800-0.867\t 23\r\n0.867-0.933\t 14\r\n0.933-1.000\t 50\r\n",
    "FormatType": "Matrix",
    "NumHits": 8
}