{
    "ID": 226,
    "Name": "OPPORTUNITY Activity Recognition",
    "Abstract": "The OPPORTUNITY Dataset for Human Activity Recognition from Wearable, Object, and Ambient Sensors is a dataset devised to benchmark human activity recognition algorithms (classification, automatic data segmentation, sensor fusion, feature extraction, etc).",
    "Types": "Multivariate, Time-Series",
    "Task": "Classification",
    "AttributeTypes": "Real",
    "NumInstances": 2551,
    "NumAttributes": 242,
    "DateDonated": "2012-06-09",
    "MissingValues": 1,
    "URLFolder": "../machine-learning-databases/00226/",
    "URLReadme": "#",
    "HighestAccuracy": 0,
    "RelevantInfo": "The OPPORTUNITY Dataset for Human Activity Recognition from Wearable, Object, and Ambient Sensors is a dataset devised to benchmark human activity recognition algorithms (classification, automatic data segmentation, sensor fusion, feature extraction, etc).\r\n\r\nA subset of this dataset was used for the \"OPPORTUNITY Activity Recognition Challenge\" organized for the 2011 IEEE conf on Systems, Man and Cybernetics Workshop on \"Robust machine learning techniques for human activity recognition\". \r\n\r\nThe dataset comprises the readings of motion sensors recorded while users executed typical daily activities:\r\n  * Body-worn sensors: 7 inertial measurement units, 12 3D acceleration sensors, 4 3D localization information\r\n  * Object sensors: 12 objects with 3D acceleration and 2D rate of turn\r\n  * Ambient sensors: 13 switches and 8 3D acceleration sensors\r\n  * Recordings: 4 users, 6 runs per users. Of these, 5 are Activity of Daily Living runs characterized by a natural execution of daily activities. The 6th run is a \"drill\" run, where users execute a scripted sequence of activities. \r\n  * Annotations/classes: the activities of the user in the scenario are annotated on different levels: \"modes of locomotion\" classes; low-level actions relating 13 actions to 23 objects; 17 mid-level gesture classes; and 5 high-level activity classes\r\n\r\n** Recording scenario **\r\n\r\nThe activity recognition environment and scenario has been designed to generate many activity primitives, yet in a realistic manner. Subjects operated in a room simulating a studio flat with a deckchair, a kitchen, doors giving access to the outside, a coffee machine, a table and a chair.\r\n\r\nWe achieved a natural execution of activities by instructing users to follow a high-level script but leaving them free interpretation as how to achieve the high-level goals. We furthermore encouraged them to perform as naturally as possible with all the variations they were used to.\r\n\r\nFor each subject we recorded 6 different runs. Five of them, termed activity of daily living (ADL), followed a given scenario as detailed below. The remaining one, a drill run, was designed to generate a large number of activity instances. The ADL run consists of temporally unfolding situations. In each situation (e.g. preparing sandwich), a large number of action primitives occur (e.g. reach for bread, move to bread cutter, operate bread cutter).\r\n\r\n* ADL run *\r\n\r\nThe ADL run consists of temporally unfolding situations:\r\n\r\n    Start: lying on the deckchair, get up\r\n    Groom: move in the room, check that all the objects are in the right places in the drawers and on shelves\r\n    Relax: go outside and have a walk around the building\r\n    Prepare coffee: prepare a coffee with milk and sugar using the coffee machine\r\n    Drink coffee: take coffee sips, move around in the environment\r\n    Prepare sandwich: include bread, cheese and salami, using the bread cutter and various knifes and plates\r\n    Eat sandwich\r\n    Cleanup: put objects used to original place or dish washer, cleanup the table\r\n    Break: lie on the deckchair\r\n\r\n* Drill run *\r\n\r\nThe drill run consists of 20 repetitions of the following sequence of activities:\r\n\r\n    Open then close the fridge\r\n    Open then close the dishwasher\r\n    Open then close 3 drawers (at different heights)\r\n    Open then close door 1\r\n    Open then close door 2\r\n    Toggle the lights on then off\r\n    Clean the table\r\n    Drink while standing\r\n    Drink while seated\r\n\r\n** Annotations **\r\n\r\nThe annotations are done on five Â‘tracksÂ’. One track contains modes of locomotion (e.g. sitting, standing, walking). Two other tracks indicate the actions of the left and right hand (e.g. reach, grasp, release), and to which object they apply (e.g. milk, switch, door).\r\nThe fourth track indicates the high level activities (e.g. prepare sandwich). The high level activities relate to the situations indicated in the description of the ADL runs as follows (in parenthesis the number of the situations indicated above): relaxing (1, 9), early morning (2, 3), coffee time (4, 5), sandwich time (6, 7), cleanup (8).\r\n\r\nThe mid-level gesture annotations is generated automatically from the low-level hand actions. It comprises coarser characterization of the user's activities. For instance the low-level annotations 'reach door' and 'open door' are combined into a single 'open door' mid-level annotation. Here, the mid-level annotations comprise actions of the left and right hand indiscriminately. However, in practice, the users mostly interacted with the environment with their right hand. We recommend to use the mid-level annotations in first attempts to use this dataset.\r\n\r\n** Applications **\r\n\r\nThis dataset offers a rich playground to assess methods such as, e.g:\r\n\r\n  * Classification, (semi-) supervised machine learning\r\n  * Automatic segmentation\r\n  * Unsupervised structure discovery\r\n  * Data imputation\r\n  * Multi-modal sensor fusion\r\n  * Sensor network research\r\n  * Transfer learning, multitask learning\r\n  * Sensor selection\r\n  * Feature extraction\r\n  * Classifier calibration and adaptation\r\n  * ...\r\n\r\n** Baseline benchmarks **\r\n\r\nBaseline benchmarks for the OPPORTUNITY Activity Recognition Challenge subset of the dataset are available in reference [2]. Scripts to replicate the benchmarks are provided in the package.",
    "Source": "Daniel Roggen, Wearable Computing Laboratory ETH Zurich, droggen@gmail.com\r\nAlberto Calatroni, Wearable Computing Laboratory ETH Zurich, calatroni.alberto@gmail.com\r\nLong-Van Nguyen-Dinh, Wearable Computing Laboratory ETH Zurich\r\nRicardo Chavarriaga, Chair in Non-Invasive Brain-Machine Interface, EPFL, ricardo.chavarriaga@epfl.ch\r\nHesam Sagha, Chair in Non-Invasive Brain-Machine Interface, EPFL, hesam.sagha@epfl.ch\r\nSundara Tejaswi Digumarti, Chair in Non-Invasive Brain-Machine Interface, EPFL",
    "Acknowledgements": "Use of this dataset in publications must be acknowledged by referencing the following publication [1] or [2]. \r\nWe recommend to refer to this dataset as the \"OPPORTUNITY Activity Recognition Dataset\" in publications.\r\nWe also appreciate if you drop us an email (daniel.roggen@ieee.org) to inform us of any publication using this dataset, so we can point to your publication on our webpage.\r\n\r\nReference [1] details the overall dataset, the scenario, the multimodality and sensor networking aspects of the setup, quality metrics, and best practices for the recording of complex multimodal activity datasets. Reference [2] provides the performance of a baseline activity recognition system on the OPPORTUNITY dataset, which can be used as a benchmark performance.\r\n\r\n[1] Daniel Roggen, Alberto Calatroni, Mirco Rossi, Thomas Holleczek, Gerhard Tröster, Paul Lukowicz, Gerald Pirkl, David Bannach, Alois Ferscha, Jakob Doppler, Clemens Holzmann, Marc Kurz, Gerald Holl, Ricardo Chavarriaga, Hesam Sagha, Hamidreza Bayati, and José del R. Millàn. \"Collecting complex activity data sets in highly rich networked sensor environments\" In Seventh International Conference on Networked Sensing Systems (INSS’10), Kassel, Germany, 2010.\r\n\r\n[2] Ricardo Chavarriaga, Hesam Sagha, Alberto Calatroni, Sundaratejaswi Digumarti, Gerhard Tröster, José del R. Millán, Daniel Roggen. \"The Opportunity challenge: A benchmark database for on-body sensor-based activity recognition\", Pattern Recognition Letters, 2013",
    "Area": "Computer",
    "RelevantPapers": "**First party**\r\n[1] Daniel Roggen, Alberto Calatroni, Mirco Rossi, Thomas Holleczek, Gerhard Tröster, Paul Lukowicz, Gerald Pirkl, David Bannach, Alois Ferscha, Jakob Doppler, Clemens Holzmann, Marc Kurz, Gerald Holl, Ricardo Chavarriaga, Hesam Sagha, Hamidreza Bayati, and José del R. Millán. \"Collecting complex activity data sets in highly rich networked sensor environments\" In Seventh International Conference on Networked Sensing Systems (INSS’10), Kassel, Germany, 6 2010.\r\n[2] Hesam Sagha, Sundara Tejaswi Digumarti, José del R. Millán, Ricardo Chavarriaga, Alberto Calatroni, Daniel Roggen, Gerhard Tröster. Benchmarking classification techniques using the Opportunity human activity dataset. IEEE International Conference on Systems, Man, and Cybernetics, Anchorage, AK, USA, October 9-12, 2011\r\n[3] Video presenting the dataset: http://vimeo.com/8704668\r\n[4] R. Chavarriaga et al. Ensemble creation and reconfiguration for activity recognition: An information theoretic approach. IEEE Conf Systems, Man, and Cybernetics (SMC), 2011\r\n[5] H. Sagha et al. Detecting anomalies to improve classification performance in an opportunistic sensor network, 7th IEEE International Workshop on Sensor Networks and Systems for Pervasive Computing (PerSens), 2011.\r\n[6] A. Calatroni et al., Automatic transfer of activity recognition capabilities between body-worn motion sensors: Training newcomers to recognize locomotion, 8th International Conference on Networked Sensing Systems (INSS), 2011\r\n[7] M. Kurz et al. Dynamic Quantification of Activity Recognition Capabilities in Opportunistic Systems. Fourth Conference on Context Awareness for Proactive Systems, 2011\r\n[8] H. Sagha et al. Detecting and rectifying anomalies in Opportunistic sensor networks. International Conference on Body Sensor Networks (BSN), 2011\r\n[9] R. Chavarriaga et al. Robust activity recognition for assistive technologies: Benchmarking ML techniques, Workshop on Machine Learning for Assistive Technologies at the 24th Annual Conference on Neural Information Processing Systems (NIPS), 2010.\r\n[10] P. Lukowicz et al. Recording a complex, multi modal activity data set for context recognition 1st Workshop on Context-Systems Design, Evaluation and Optimisation at ARCS, 2010, 2010\r\n[11] R. Chavarriaga, H. Sagha, A. Calatroni, S. Digumarti, G. Tröster, J. del R. Millán, D. Roggen. The Opportunity challenge: A benchmark database for on-body sensor-based activity recognition, Pattern Recognition Letters, 2013\r\n[12] L.-V. Nguyen-Dinh, D. Roggen, A. Calatroni, G. Tröster. Improving online gesture recognition with template matching methods in accelerometer data, Proc 12th Int Conf on Intelligent Systems Design and Applications, 2012\r\n\r\n**Third party**\r\nHere are a few of the papers from third parties using the OPPORTUNITY dataset:\r\n\r\n[100] T. Plötz, N. Y.  Hammerla, P. Olivier. Feature Learning for Activity Recognition in Ubiquitous Computing, IJCAI, 2011\r\n[101] A. Manzoor et al., Identifying Important Action Primitives for High Level Activity Recognition, Proc. European Conference on Smart Sensing and Context (EuroSSC), 2010\r\n[102] T. Ploetz, N. Hammerla, A. Rozga, A. Reavis, N. Call, G. Abowd. Automatic Assessment of Problem Behavior in Individuals with Developmental Disabilities. Proc. 14th Int Conf on Ubiquitous Computing, 2012.\r\n[103] D. Gordon, J. Czerny, M. Beigl. Activity Recognition for Creatures of Habit: Energy-Efficient Embedded Classification using Prediction. Personal and Ubiquitous Computing, 2013.",
    "AttributeInfo": "The dataset comprises the readings of motion sensors recorded while users executed typical daily activities. The detailed format is described in the package. The attributes correspond to raw sensor readings. There is a total of 242 attributes.\r\n\r\n* Body-worn sensors (145 attributes) *\r\n\r\nThe body-worn sensors include 7 inertial measurement units and 12 3D acceleration sensors.\r\n\r\nThe inertial measurement units provide readings of: 3D acceleration, 3D rate of turn, 3D magnetic field, and orientation of the sensor with respect to a world coordinate system in quaternions. Five sensors are on the upper body and two are mounted on the user's shoes.\r\n\r\nThe acceleration sensors provide 3D acceleration. They are mounted on the upper body, hip and leg.\r\n\r\nFour tags for an ultra-wideband localization system are placed on the left/right front/back side of the shoulder.  \r\n\r\n* Object sensors (60 attributes) *\r\n\r\n12 objects are instrumented with wireless sensors measuring 3D acceleration and 2D rate of turn. This allows to detect which objects are used, and possibly also the kind of usage that is made of them.\r\n\r\n* Ambient sensors (37 attributes) *\r\n\r\nAmbient sensors include 13 switches and 8 3D acceleration sensors in drawers, kitchen appliances and doors.\r\n\r\nThe reed switches are placed in triplets on the fridge, dishwasher and drawer 2 and drawer 3. They may be used to detect three states of the furniture element: closed, half open, and fully open. \r\n\r\nThe acceleration sensors may allow to assess if an element of furniture is used, and whether it may be opened or closed.",
    "FormatType": "Matrix",
    "NumHits": 8
}