{
    "ID": 262,
    "Name": "Turkiye Student Evaluation",
    "Abstract": "This data set contains a total 5820 evaluation scores provided by students from Gazi University in Ankara (Turkey). There is a total of 28 course specific questions and additional 5 attributes.",
    "Types": "Multivariate",
    "Task": "Classification, Clustering",
    "AttributeTypes": "",
    "NumInstances": 5820,
    "NumAttributes": 33,
    "DateDonated": "2013-09-01",
    "MissingValues": 0,
    "URLFolder": "../machine-learning-databases/00262/",
    "URLReadme": "#",
    "HighestAccuracy": 0,
    "RelevantInfo": "N/A",
    "Source": "Ernest Fokoue\r\nCenter for Quality and Applied Statistics\r\nRochester Institute of Technology\r\n98 Lomb Memorial Drive\r\nRochester, NY 14623, USA \r\neMaÄ±l: epfeqa@rit.edu  \r\n\r\nNecla Gunduz\r\nDepartment of Statistics \r\nFaculty of Science, Gazi University\r\nTeknikokullar,06500 Ankara, Turkey \r\neMail: ngunduz@gazi.edu.tr\r\ngunduznecla@yahoo.com ",
    "Acknowledgements": "If you publish material based on databases obtained from this repository, then, in your acknowledgements, please note the assistance you received by using this repository. This will help others to obtain the same data sets and replicate your experiments. We suggest the following pseudo-APA reference format for referring to this repository:\r\n\r\nGunduz, G. & Fokoue, E. (2013). UCI Machine Learning Repository [http://archive.ics.uci.edu/ml]. Irvine, CA: University of California, School of Information and Computer Science.\r\n\r\nHere is a BiBTeX citation as well:\r\n\r\n@misc{GunduzFokoue:2013 ,\r\nauthor = 'Gunduz, N. and Fokoue, E.',\r\nyear = '2013',\r\ntitle = '{UCI} Machine Learning Repository',\r\nurl = 'http://archive.ics.uci.edu/ml',\r\ninstitution = 'University of California, Irvine, School of Information and Computer Sciences' }",
    "Area": "Other",
    "RelevantPapers": "N/A",
    "AttributeInfo": "   instr: Instructor's identifier; values taken from {1,2,3}\r\n   class: Course code (descriptor); values taken from {1-13}\r\n   repeat: Number of times the student is taking this course; values taken from {0,1,2,3,...}\r\n   attendance: Code of the level of attendance; values from {0, 1, 2, 3, 4}\r\n   difficulty: Level of difficulty of the course as perceived by the student; values taken from {1,2,3,4,5}\r\n   Q1:  The semester course content, teaching method and evaluation system were provided at the start.\r\n   Q2:  The course aims and objectives were clearly stated at the beginning of the period.\r\n   Q3:  The course was worth the amount of credit assigned to it.\r\n   Q4:  The course was taught according to the syllabus announced on the first day of class.\r\n   Q5:\tThe class discussions, homework assignments, applications and studies were satisfactory.\r\n   Q6:  The textbook and other courses resources were sufficient and up to date.\t\t\t\t\r\n   Q7:  The course allowed field work, applications, laboratory, discussion and other studies.\r\n   Q8:  The quizzes, assignments, projects and exams contributed to helping the learning.\t\r\n   Q9:  I greatly enjoyed the class and was eager to actively participate during the lectures.\r\n   Q10: My initial expectations about the course were met at the end of the period or year.\r\n   Q11: The course was relevant and beneficial to my professional development.\r\n   Q12: The course helped me look at life and the world with a new perspective.\r\n   Q13: The Instructor's knowledge was relevant and up to date.\r\n   Q14: The Instructor came prepared for classes.\r\n   Q15: The Instructor taught in accordance with the announced lesson plan.\r\n   Q16: The Instructor was committed to the course and was understandable.\r\n   Q17: The Instructor arrived on time for classes.\r\n   Q18: The Instructor has a smooth and easy to follow delivery/speech.\r\n   Q19: The Instructor made effective use of class hours.\r\n   Q20: The Instructor explained the course and was eager to be helpful to students.\r\n   Q21: The Instructor demonstrated a positive approach to students.\r\n   Q22: The Instructor was open and respectful of the views of students about the course.\r\n   Q23: The Instructor encouraged participation in the course.\r\n   Q24: The Instructor gave relevant homework assignments/projects, and helped/guided students.\r\n   Q25: The Instructor responded to questions about the course inside and outside of the course.\r\n   Q26: The Instructor's evaluation system (midterm and final questions, projects, assignments, etc.) effectively measured the course objectives.\r\n   Q27: The Instructor provided solutions to exams and discussed them with students.\r\n   Q28: The Instructor treated all students in a right and objective manner.\r\n   \r\n   Q1-Q28 are all Likert-type, meaning that the values are taken from {1,2,3,4,5}",
    "FormatType": "Matrix",
    "NumHits": 9
}