{
    "ID": 31,
    "Name": "Covertype",
    "Abstract": "Forest CoverType dataset",
    "Types": "Multivariate",
    "Task": "Classification",
    "AttributeTypes": "Categorical, Integer",
    "NumInstances": 581012,
    "NumAttributes": 54,
    "DateDonated": "1998-08-01",
    "MissingValues": 0,
    "URLFolder": "../machine-learning-databases/covtype/",
    "URLReadme": "../machine-learning-databases/covtype/covtype.info",
    "HighestAccuracy": 70,
    "RelevantInfo": "Predicting forest cover type from cartographic variables only (no remotely sensed data).  The actual forest cover type for a given observation (30 x 30 meter cell) was determined from US Forest Service (USFS) Region 2 Resource Information System (RIS) data.  Independent variables were derived from data originally obtained from US Geological Survey (USGS) and USFS data.  Data is in raw form (not scaled) and contains binary (0 or 1) columns of data for qualitative independent variables (wilderness areas and soil types).\r\n\r\nThis study area includes four wilderness areas located in the Roosevelt National Forest of northern Colorado.  These areas represent forests with minimal human-caused disturbances, so that existing forest cover types are more a result of ecological processes rather than forest management practices.\r\n\r\nSome background information for these four wilderness areas: Neota (area 2) probably has the highest mean elevational value of the 4 wilderness areas. Rawah (area 1) and Comanche Peak (area 3) would have a lower mean elevational value, while Cache la Poudre (area 4) would have the lowest mean elevational value. \r\n\r\nAs for primary major tree species in these areas, Neota would have spruce/fir (type 1), while Rawah and Comanche Peak would probably have lodgepole pine (type 2) as their primary species, followed by spruce/fir and aspen (type 5). Cache la Poudre would tend to have Ponderosa pine (type 3), Douglas-fir (type 6), and cottonwood/willow (type 4).  \r\n\r\nThe Rawah and Comanche Peak areas would tend to be more typical of the overall dataset than either the Neota or Cache la Poudre, due to their assortment of tree species and range of predictive variable values (elevation, etc.)  Cache la Poudre would probably  be more unique than the others, due to its relatively low  elevation range and species composition. ",
    "Source": "Original Owners of Database:\r\n\r\nRemote Sensing and GIS Program\r\nDepartment of Forest Sciences\r\nCollege of Natural Resources\r\nColorado State University\r\nFort Collins, CO  80523\r\n(contact Jock A. Blackard, jblackard@fs.fed.us or Dr. Denis J. Dean, denis.dean@utdallas.edu)\r\n\r\nDonors of database:\r\n\r\n1. Jock A. Blackard (jblackard@fs.fed.us)\r\nGIS Coordinator\r\nUSFS - Forest Inventory & Analysis\r\nRocky Mountain Research Station\r\n507 25th Street\r\nOgden, UT 84401 \r\n\r\n2. Dr. Denis J. Dean (denis.dean@utdallas.edu)\r\nProfessor\r\nProgram in Geography and Geospatial Sciences\r\nSchool of Economic, Political and Policy Sciences\r\n800 West Campbell Rd\r\nRichardson, TX  75080-3021 \r\n\r\n3. Dr. Charles W. Anderson (anderson@cs.colostate.edu)\r\nAssociate Professor\r\nDepartment of Computer Science\r\nColorado State University\r\nFort Collins, CO  80523  USA",
    "Acknowledgements": "Reuse of this database is unlimited with retention of copyright notice for Jock A. Blackard and Colorado State University.",
    "Area": "Life",
    "RelevantPapers": "Blackard, Jock A. and Denis J. Dean.  2000.  \"Comparative Accuracies of Artificial Neural Networks and Discriminant Analysis in Predicting Forest Cover Types from Cartographic Variables.\"  Computers and Electronics in Agriculture  24(3):131-151.\r\nhttp://rexa.info/paper/d44ba72ee840ac929fb2b78f6d9f6c6b408ff1da\r\n\r\nBlackard, Jock A. and Denis J. Dean.  1998.  \"Comparative Accuracies of Neural Networks and Discriminant Analysis in Predicting Forest Cover Types from Cartographic Variables.\"  Second Southern Forestry GIS Conference. University of Georgia.  Athens, GA.  Pages 189-199.\r\n\r\nBlackard, Jock A.  1998.  \"Comparison of Neural Networks and Discriminant Analysis in Predicting Forest Cover Types.\" Ph.D. dissertation.  Department of Forest Sciences.  Colorado State University.  Fort Collins, Colorado.  165 pages.",
    "AttributeInfo": "Given is the attribute name, attribute type, the measurement unit and a brief description.  The forest cover type is the classification  problem.  The order of this listing corresponds to the order of numerals along the rows of the database.\r\n\r\nName / Data Type / Measurement / Description\r\n\r\nElevation / quantitative /meters / Elevation in meters\r\nAspect / quantitative / azimuth / Aspect in degrees azimuth\r\nSlope / quantitative / degrees / Slope in degrees\r\nHorizontal_Distance_To_Hydrology / quantitative / meters / Horz Dist to nearest surface water features\r\nVertical_Distance_To_Hydrology / quantitative / meters / Vert Dist to nearest surface water features\r\nHorizontal_Distance_To_Roadways / quantitative / meters / Horz Dist to nearest roadway\r\nHillshade_9am / quantitative / 0 to 255 index / Hillshade index at 9am, summer solstice\r\nHillshade_Noon / quantitative / 0 to 255 index / Hillshade index at noon, summer soltice\r\nHillshade_3pm / quantitative / 0 to 255 index / Hillshade index at 3pm, summer solstice\r\nHorizontal_Distance_To_Fire_Points / quantitative / meters / Horz Dist to nearest wildfire ignition points\r\nWilderness_Area (4 binary columns) / qualitative / 0 (absence) or 1 (presence) / Wilderness area designation\r\nSoil_Type (40 binary columns) / qualitative / 0 (absence) or 1 (presence) / Soil Type designation\r\nCover_Type (7 types) / integer / 1 to 7 / Forest Cover Type designation",
    "FormatType": "Dense-Matrix",
    "NumHits": 12693
}