{
    "ID": 339,
    "Name": "Taxi Service Trajectory - Prediction Challenge, ECML PKDD 2015",
    "Abstract": "An accurate dataset describing trajectories performed by all the 442 taxis running in the city of Porto, in Portugal.\r\n",
    "Types": "Multivariate, Sequential, Time-Series, Domain-Theory",
    "Task": "Clustering, Causal-Discovery",
    "AttributeTypes": "Real",
    "NumInstances": 1710671,
    "NumAttributes": 9,
    "DateDonated": "2015-07-11",
    "MissingValues": 1,
    "URLFolder": "../machine-learning-databases/00339/",
    "URLReadme": "#",
    "HighestAccuracy": 0,
    "RelevantInfo": "For complete information see the official challenge page:\r\nhttp://www.geolink.pt/ecmlpkdd2015-challenge/dataset.html",
    "Source": "Challenge Chair: Luis Moreira-Matias\n\nSteering Committee:\n - Michel Ferreira\n - Joao Mendes-Moreira\n\ntst.challenge@ecmlpkdd2015.org\n\nhttp://www.geolink.pt/ecmlpkdd2015-challenge/whoweare.html",
    "Acknowledgements": "Moreira-Matias, L., Gama, J., Ferreira, M., Mendes-Moreira, J., Damas, L., ”Predicting Taxi–Passenger Demand Using Streaming Data”. In: IEEE Transactions on Intelligent Transportation Systems, vol.14, no.3, pp.1393-1402, September (2013)",
    "Area": "Computer",
    "RelevantPapers": "Moreira-Matias L., Gama J., Ferreira M., Mendes-Moreira J. and Damas L.,: \"Time-Evolving OD Matrix Estimation using high-speed GPS data streams\". In: Expert Systems with Applications, vol. 44, pp. 275-288, February (2016)\n \nMoreira-Matias, L., Gama, J., Ferreira, M., Mendes-Moreira, J., Damas, L., ”Predicting Taxi–Passenger Demand Using Streaming Data”. In: IEEE Transactions on Intelligent Transportation Systems, vol.14, no.3, pp.1393-1402, September (2013)",
    "AttributeInfo": "Each data sample corresponds to one completed trip. It contains a total of 9 (nine) features, described as follows:\n\nTRIP_ID: (String) It contains a unique identifier for each trip;\n\nCALL_TYPE: (char) It identifies the way used to demand this service. It may contain one of three possible values:\n  - 'A' if this trip was dispatched from the central;\n  - 'B' if this trip was demanded directly to a taxi driver at a specific stand;\n  - 'C' otherwise (i.e. a trip demanded on a random street).\n\nORIGIN_CALL: (integer) It contains a unique identifier for each phone number which was used to demand, at least, one service. It identifies the trip's customer if CALL_TYPE='A'. Otherwise, it assumes a NULL value;\n\nORIGIN_STAND: (integer): It contains a unique identifier for the taxi stand. It identifies the starting point of the trip if CALL_TYPE='B'. Otherwise, it assumes a NULL value;\n\nTAXI_ID: (integer): It contains a unique identifier for the taxi driver that performed each trip;\n\nTIMESTAMP: (integer) Unix Timestamp (in seconds). It identifies the trip's start;\n\nDAYTYPE: (char) It identifies the daytype of the trip's start. It assumes one of three possible values:\n  - 'B' if this trip started on a holiday or any other special day (i.e. extending holidays, floating holidays, etc.);\n  - 'C' if the trip started on a day before a type-B day;\n  - 'A' otherwise (i.e. a normal day, workday or weekend).\n\nIMPORTANT NOTICE: This field has not been correctly calculated. Please see the following links as reliable sources for official holidays in Portugal.\nhttp://calendar.retira.eu/public-holidays/portugal/2013/\nhttp://calendar.retira.eu/public-holidays/portugal/2014/\n\nMISSING_DATA: (Boolean) It is FALSE when the GPS data stream is complete and TRUE whenever one (or more) locations are missing;\n\nPOLYLINE: (String): It contains a list of GPS coordinates (i.e. WGS84 format) mapped as a string. The beginning and the end of the string are identified with brackets (i.e. [ and ], respectively). Each pair of coordinates is also identified by the same brackets as [LONGITUDE, LATITUDE]. This list contains one pair of coordinates for each 15 seconds of trip. The last list item corresponds to the trip's destination while the first one represents its start.",
    "FormatType": "",
    "NumHits": 8
}