{
    "ID": 384,
    "Name": "Quality Assessment of Digital Colposcopies",
    "Abstract": "This dataset explores the subjective quality assessment of digital colposcopies.",
    "Types": "Multivariate",
    "Task": "Classification",
    "AttributeTypes": "Real",
    "NumInstances": 287,
    "NumAttributes": 69,
    "DateDonated": "2017-03-08",
    "MissingValues": 0,
    "URLFolder": "../machine-learning-databases/00384/",
    "URLReadme": "#",
    "HighestAccuracy": 0,
    "RelevantInfo": "* The dataset was acquired and annotated by professional physicians at 'Hospital Universitario de Caracas'.\r\n* The subjective judgments (target variables) were originally done in an ordinal manner (poor, fair, good, excellent) and was discretized in two classes (bad, good).\r\n* Images were randomly sampled from the original colposcopic sequences (videos).\r\n* The original images and the manual segmentations are included in the 'images' directory.\r\n* The dataset has three modalities (i.e. Hinselmann, Green, Schiller).\r\n* The target variables are expert::X (X in 0,...,5) and consensus.",
    "Source": "Kelwin Fernandes (kafc _at_ inesctec _dot_ pt) - INESC TEC & FEUP, Porto, Portugal.\r\nJaime S. Cardoso - INESC TEC & FEUP, Porto, Portugal.\r\nJessica Fernandes - Universidad Central de Venezuela, Caracas, Venezuela.",
    "Acknowledgements": "Fernandes, Kelwin, Jaime S. Cardoso, and Jessica Fernandes. 'Transfer Learning with Partial Observability Applied to Cervical Cancer Screening.' Iberian Conference on Pattern Recognition and Image Analysis. Springer International Publishing, 2017.",
    "Area": "Life",
    "RelevantPapers": "Fernandes, Kelwin, Jaime S. Cardoso, and Jessica Fernandes. 'Transfer Learning with Partial Observability Applied to Cervical Cancer Screening.' Iberian Conference on Pattern Recognition and Image Analysis. Springer International Publishing, 2017.",
    "AttributeInfo": "Three modalities: hinselmann, green, schiller.\r\nNumber of Attributes: 69 (62 predictive attributes, 7 target variables)\r\n\r\ncervix_area: image area with cervix.\r\nos_area: image area with external os.\r\nwalls_area: image area with vaginal walls.\r\nspeculum_area: image area with the speculum.\r\nartifacts_area: image area with artifacts.\r\ncervix_artifacts_area: cervix area with the artifacts.\r\nos_artifacts_area: external os area with the artifacts.\r\nwalls_artifacts_area: vaginal walls with the artifacts.\r\nspeculum_artifacts_area: speculum area with the artifacts.\r\ncervix_specularities_area: cervix area with the specular reflections.\r\nos_specularities_area: external os area with the specular reflections.\r\nwalls_specularities_area: vaginal walls area with the specular reflections.\r\nspeculum_specularities_area: speculum area with the specular reflections.\r\nspecularities_area: total area with specular reflections.\r\narea_h_max_diff: maximum area differences between the four cervix quadrants.\r\nrgb_cervix_r_mean: average color information in the cervix (R channel).\r\nrgb_cervix_r_std: stddev color information in the cervix (R channel).\r\nrgb_cervix_r_mean_minus_std: (avg - stddev) color information in the cervix (R channel).\r\nrgb_cervix_r_mean_plus_std: (avg + stddev) information in the cervix (R channel).\r\nrgb_cervix_g_mean: average color information in the cervix (G channel).\r\nrgb_cervix_g_std: stddev color information in the cervix (G channel).\r\nrgb_cervix_g_mean_minus_std: (avg - stddev)  color information in the cervix (G channel).\r\nrgb_cervix_g_mean_plus_std: (avg + stddev) color information in the cervix (G channel).\r\nrgb_cervix_b_mean: average color information in the cervix (B channel).\r\nrgb_cervix_b_std: stddev color information in the cervix (B channel).\r\nrgb_cervix_b_mean_minus_std: (avg - stddev) color information in the cervix (B channel).\r\nrgb_cervix_b_mean_plus_std: (avg + stddev) color information in the cervix (B channel).\r\nrgb_total_r_mean: average color information in the image (B channel).\r\nrgb_total_r_std: stddev color information in the image (R channel).\r\nrgb_total_r_mean_minus_std: (avg - stddev) color information in the image (R channel).\r\nrgb_total_r_mean_plus_std: (avg + stddev) color information in the image (R channel).\r\nrgb_total_g_mean: average color information in the image (G channel).\r\nrgb_total_g_std: stddev color information in the image (G channel).\r\nrgb_total_g_mean_minus_std: (avg - stddev) color information in the image (G channel).\r\nrgb_total_g_mean_plus_std: (avg + stddev) color information in the image (G channel).\r\nrgb_total_b_mean: average color information in the image (B channel).\r\nrgb_total_b_std: stddev color information in the image (B channel).\r\nrgb_total_b_mean_minus_std: (avg - stddev) color information in the image (B channel).\r\nrgb_total_b_mean_plus_std: (avg + stddev) color information in the image (B channel).\r\nhsv_cervix_h_mean: average color information in the cervix (H channel).\r\nhsv_cervix_h_std: stddev color information in the cervix (H channel).\r\nhsv_cervix_s_mean: average color information in the cervix (S channel).\r\nhsv_cervix_s_std: stddev color information in the cervix (S channel).\r\nhsv_cervix_v_mean: average color information in the cervix (V channel).\r\nhsv_cervix_v_std: stddev color information in the cervix (V channel).\r\nhsv_total_h_mean: average color information in the image (H channel).\r\nhsv_total_h_std: stddev color information in the image (H channel).\r\nhsv_total_s_mean: average color information in the image (S channel).\r\nhsv_total_s_std: stddev color information in the image (S channel).\r\nhsv_total_v_mean: average color information in the image (V channel).\r\nhsv_total_v_std: stddev color information in the image (V channel).\r\nfit_cervix_hull_rate: Coverage of the cervix convex hull by the cervix.\r\nfit_cervix_hull_total: Image coverage of the cervix convex hull.\r\nfit_cervix_bbox_rate: Coverage of the cervix bounding box by the cervix.\r\nfit_cervix_bbox_total: Image coverage of the cervix bounding box.\r\nfit_circle_rate: Coverage of the cervix circle by the cervix.\r\nfit_circle_total: Image coverage of the cervix circle.\r\nfit_ellipse_rate: Coverage of the cervix ellipse by the cervix.\r\nfit_ellipse_total: Image coverage of the cervix ellipse.\r\nfit_ellipse_goodness: Goodness of the ellipse fitting.\r\ndist_to_center_cervix: Distance between the cervix center and the image center.\r\ndist_to_center_os: Distance between the cervical os center and the image center.\r\nexperts::0: subjective assessment of the Expert 0 (target variable).\r\nexperts::1: subjective assessment of the Expert 1 (target variable).\r\nexperts::2: subjective assessment of the Expert 2 (target variable).\r\nexperts::3: subjective assessment of the Expert 3 (target variable).\r\nexperts::4: subjective assessment of the Expert 4 (target variable).\r\nexperts::5: subjective assessment of the Expert 5 (target variable).\r\nconsensus: subjective assessment of the consensus (target variable).",
    "FormatType": "Matrix",
    "NumHits": 1
}