{
    "ID": 405,
    "Name": "Motion Capture Hand Postures",
    "Abstract": "5 types of hand postures from 12 users were recorded using unlabeled markers on fingers of a glove in a motion capture environment. Due to resolution and occlusion, missing values are common.",
    "Types": "Multivariate",
    "Task": "Classification, Clustering",
    "AttributeTypes": "Real",
    "NumInstances": 78095,
    "NumAttributes": 38,
    "DateDonated": "2017-01-27",
    "MissingValues": 1,
    "URLFolder": "../machine-learning-databases/00405/",
    "URLReadme": "#",
    "HighestAccuracy": 0,
    "RelevantInfo": "A Vicon motion capture camera system was used to record 12 users performing 5 hand postures with markers attached to a left-handed glove. \r\n\r\nA rigid pattern of markers on the back of the glove was used to establish a local coordinate system for the hand, and 11 other markers were attached to the thumb and fingers of the glove. 3 markers were attached to the thumb with one above the thumbnail and the other two on the knuckles. 2 markers were attached to each finger with one above the fingernail and the other on the joint between the proximal and middle phalanx.\r\n\r\nThe 11 markers not part of the rigid pattern were unlabeled; their positions were not explicitly tracked. Consequently, there is no a priori correspondence between the markers of two given records. In addition, due to the resolution of the capture volume and self-occlusion due to the orientation and configuration of the hand and fingers, many records have missing markers. Extraneous markers were also possible due to artifacts in the Vicon software's marker reconstruction/recording process and other objects in the capture volume. As a result, the number of visible markers in a record varied considerably.\r\n\r\nThe data presented here is already partially preprocessed. First, all markers were transformed to the local coordinate system of the record containing them. Second, each transformed marker with a norm greater than 200 millimeters was pruned. Finally, any record that contained fewer than 3 markers was removed. The processed data has at most 12 markers per record and at least 3. For more information, see 'Attribute Information'.\r\n\r\nDue to the manner in which data was captured, it is likely that for a given record and user there exists a near duplicate record originating from the same user. We recommend therefore to evaluate classification algorithms on a leave-one-user-out basis wherein each user is iteratively left out from training and used as a test set. One then tests the generalization of the algorithm to new users. A 'User' attribute is provided to accomodate this strategy. \r\n\r\nThis dataset may be used for a variety of tasks, the most obvious of which is posture recognition via classification. One may also attempt user identification. Alternatively, one may perform clustering (constrained or unconstrained) to discover marker distributions either as an attempt to predict marker identities or obtain statistical descriptions/visualizations of the postures.\r\n\r\nIn previous work, we randomly sampled without replacement a constant number (e.g. 75) of records per class per user in order to balance classes.\r\n\r\nA mirror of the dataset may currently be obtained at http://www2.latech.edu/~jkanno/collaborative.htm by following the Postures link.",
    "Source": "[1] A. Gardner, R. R. Selmic, J. Kanno\r\n    Louisiana Tech University\r\n    andrew.gardner1@ieee.org, rselmic@latech.edu, jkanno@latech.edu\r\n[2] C. A. Duncan\r\n    Quinnipiac University\r\n    christian.duncan@quinnipiac.edu",
    "Acknowledgements": "If you have no special citation requests, please leave this field blank.",
    "Area": "Computer",
    "RelevantPapers": "A. Gardner, J. Kanno, C. A. Duncan, and R. Selmic. 'Measuring distance between unordered sets of different sizes,' in 2014 IEEE Conference on Computer Vision and Pattern Recognition(CVPR), June 2014, pp. 137-143.\r\nA. Gardner, C. A. Duncan, J. Kanno, and R. Selmic. '3D hand posture recognition from small unlabeled point sets,' in 2014 IEEE International Conference on Systems, Man and Cybernetics (SMC), Oct 2014, pp. 164-169.\r\n",
    "AttributeInfo": "Data is provided as a CSV file. A header provides the name of each attribute. An initial dummy record composed entirely of 0s should be ignored. A question mark '?' is used to indicate a missing value. A record corresponds to a single instant or frame as recorded by the camera system.\r\n\r\n'Class' - Integer. The class ID of the given record. Ranges from 1 to 5 with 1=Fist(with thumb out), 2=Stop(hand flat), 3=Point1(point with pointer finger), 4=Point2(point with pointer and middle fingers), 5=Grab(fingers curled as if to grab).\r\n'User' - Integer. The ID of the user that contributed the record. No meaning other than as an identifier.\r\n'Xi' - Real. The x-coordinate of the i-th unlabeled marker position. 'i' ranges from 0 to 11.\r\n'Yi' - Real. The y-coordinate of the i-th unlabeled marker position. 'i' ranges from 0 to 11.\r\n'Zi' - Real. The z-coordinate of the i-th unlabeled marker position. 'i' ranges from 0 to 11.\r\n\r\nEach record is a set. The i-th marker of a given record does not necessarily correspond to the i-th marker of a different record. One may randomly permute the visible (i.e. not missing) markers of a given record without changing the set that the record represents. For the sake of convenience, all visible markers of a given record are given a lower index than any missing marker. A class is not guaranteed to have even a single record with all markers visible.\r\n",
    "FormatType": "Matrix",
    "NumHits": 1
}