{
    "ID": 427,
    "Name": "Activity recognition with healthy older people using a batteryless wearable sensor",
    "Abstract": "Sequential motion data from 14 healthy older people aged 66 to 86 years old using a batteryless, wearable sensor on top of their clothing for the recognition of activities in clinical environments.",
    "Types": "Sequential",
    "Task": "Classification",
    "AttributeTypes": "Real",
    "NumInstances": 75128,
    "NumAttributes": 9,
    "DateDonated": "2016-12-12",
    "MissingValues": 0,
    "URLFolder": "../machine-learning-databases/00427/",
    "URLReadme": "#",
    "HighestAccuracy": 0,
    "RelevantInfo": "This dataset contains the motion data of 14 healthy older aged between 66 and 86 years old, performed broadly scripted activities using a batteryless, wearable sensor on top of their clothing at sternum level. Data is sparse and noisy due to the use of a passive sensor. \r\nParticipants were allocated in two clinical room settings (S1 and S2). The setting of S1 (Room1) uses 4 RFID reader antennas around the room (one on ceiling level, and 3 on wall level) for the collection of data, whereas the room setting S2 (Room2) uses 3 RFID reader antennas (two at ceiling level and one at wall level) for the collection of motion data. \r\nThe activities performed were: \r\n walking to the chair, \r\n sitting on the chair, \r\n getting off the chair, \r\n walking to bed, \r\n lying on bed, \r\n getting off the bed and \r\n walking to the door. \r\nHence the possible class labels assigned for every sensor observation are:\r\n- Sitting on bed\r\n- Sitting on chair\r\n- Lying on bed\r\n- Ambulating, where ambulating includes standing, walking around the room. \r\n",
    "Source": "Roberto Luis Shinmoto Torres, University of Adelaide, roberto.shinmototorres@adelaide.edu.au\r\nDamith Ranasinghe, University of Adelaide, damith.ranasinghe@adelaide.edu.au.\r\nRenuka Visvanathan, University of Adelaide, renuka.visvanathan@adelaide.edu.au.",
    "Acknowledgements": "Shinmoto Torres, R. L., Ranasinghe, D. C., Shi, Q., Sample, A. P. (2013, April). Sensor enabled wearable RFID technology for mitigating the risk of falls near beds. In 2013 IEEE International Conference on RFID (pp. 191-198). IEEE.",
    "Area": "Life",
    "RelevantPapers": "Wickramasinghe, A., Ranasinghe, D. C., Fumeaux, C., Hill, K. D., Visvanathan, R. (2016), 'Sequence Learning with Passive RFID Sensors for Real Time Bed-egress Recognition in Older People,' in IEEE Journal of Biomedical and Health Informatics , vol.PP, no.99, pp.1-1\r\n\r\nShinmoto Torres, R. L., Visvanathan, R., Hoskins, S., van den Hengel, A., Ranasinghe, D. C. (2016). Effectiveness of a batteryless and wireless wearable sensor system for identifying bed and chair exits in healthy older people. Sensors, 16(4), 546.\r\n\r\nWickramasinghe, A., Ranasinghe, D. C. (2015, August). Recognising Activities in Real Time Using Body Worn Passive Sensors With Sparse Data Streams: To Interpolate or Not To Interpolate?. In proceedings of the 12th EAI International Conference on Mobile and Ubiquitous Systems: Computing, Networking and Services (pp. 21-30). ICST.\r\n\r\nShinmoto Torres, R. L., Ranasinghe, D. C., Shi, Q. (2013, December). Evaluation of wearable sensor tag data segmentation approaches for real time activity classification in elderly. In International Conference on Mobile and Ubiquitous Systems: Computing, Networking, and Services (pp. 384-395). Springer International Publishing.\r\n\r\nShinmoto Torres, R. L., Ranasinghe, D. C., Shi, Q., Sample, A. P. (2013, April). Sensor enabled wearable RFID technology for mitigating the risk of falls near beds. In 2013 IEEE International Conference on RFID (pp. 191-198). IEEE.",
    "AttributeInfo": "The content of the file is as follows:\r\nComma separated values (CSV) format.\r\nColumn 1: Time in seconds \r\nColumn 2: Acceleration reading in G for frontal axis\r\nColumn 3: Acceleration reading in G for vertical axis\r\nColumn 4: Acceleration reading in G for lateral axis\r\nColumn 5: Id of antenna reading sensor\r\nColumn 6: Received signal strength indicator (RSSI) \r\nColumn 7: Phase\r\nColumn 8: Frequency\r\nColumn 9: Label of activity, 1: sit on bed, 2: sit on chair, 3: lying, 4: ambulating\r\nIn addition, gender of participant is included in the last character of file name eg: d1p33F (F:female).",
    "FormatType": "",
    "NumHits": 0
}