{
    "ID": 474,
    "Name": "BAUM-2",
    "Abstract": "A multilingual audio-visual affective face database consisting of 1047 video clips of 286 subjects. ",
    "Types": "Time-Series",
    "Task": "Classification",
    "AttributeTypes": "",
    "NumInstances": 1047,
    "NumAttributes": 0,
    "DateDonated": "2018-11-09",
    "MissingValues": 0,
    "URLFolder": "../machine-learning-databases/00474/",
    "URLReadme": "#",
    "HighestAccuracy": 0,
    "RelevantInfo": "A multilingual audio-visual affective face database consisting of 1047 video clips of 286 subjects. The collected clips simulate real-world conditions by containing various head poses, illumination conditions, accessories, temporary occlusions and subjects with a wide range of ages.\r\n\r\nIn order to download the database please send an e-mail to cigdem.turan@connect.polyu.hk or cigdem.erogluerdem@gmail.com",
    "Source": "C. E. Erdem, C. Turan, Z. AydÄ±n, 'BAUM-2: a multilingual audio-visual affecive face database', Multimedia Tools and Applications, vol.74, pp. 7429-7459, 2015. \r\nDOI 10.1007/s11042-014-1986-2\r\n\r\n\r\n\r\n",
    "Acknowledgements": "C. E. Erdem, C. Turan, Z. AydÄ±n, 'BAUM-2: a multilingual audio-visual affective face database', Multimedia Tools and Applications, vol.74, pp. 7429-7459, 2015. \r\nDOI 10.1007/s11042-014-1986-2",
    "Area": "Computer",
    "RelevantPapers": "\r\nHistogram-based local descriptors for facial expression recognition (FER): A comprehensive study\r\nBy: Turan, Cigdem; Lam, Kin-Man\r\nJOURNAL OF VISUAL COMMUNICATION AND IMAGE REPRESENTATION  Volume: 55   Pages: 331-341   Published: AUG 2018\r\n\r\n\r\nBAUM-1: A Spontaneous Audio-Visual Face Database of Affective and Mental States\r\nBy: Zhalehpour, Sara; Onder, Onur; Akhtar, Zahid; et al.\r\nIEEE TRANSACTIONS ON AFFECTIVE COMPUTING  Volume: 8   Issue: 3   Pages: 300-313   Published: JUL-SEP 2017\r\n\r\n\r\nAffect Recognition using Key Frame Selection based on Minimum Sparse Reconstruction\r\nBy: Kayaoglu, Mehmet; Erdem, Cigdem Eroglu\r\nConference: 2015 ACM International Conference on Multimodal Interaction Location: Seattle, WA Date: NOV 09-13, 2015\r\nSponsor(s): ACM SIGCHI\r\nICMI'15: PROCEEDINGS OF THE 2015 ACM INTERNATIONAL CONFERENCE ON MULTIMODAL INTERACTION  Pages: 519-524   Published: 2015",
    "AttributeInfo": "The readme file contains more information about the format of the database. ",
    "FormatType": "",
    "NumHits": 0
}