{
    "ID": 497,
    "Name": "Divorce Predictors data set",
    "Abstract": "Participants completed the Personal Information Form and Divorce Predictors Scale. ",
    "Types": "Multivariate, Univariate",
    "Task": "Classification",
    "AttributeTypes": "Integer",
    "NumInstances": 170,
    "NumAttributes": 54,
    "DateDonated": "2019-07-24",
    "MissingValues": 0,
    "URLFolder": "../machine-learning-databases/00497/",
    "URLReadme": "#",
    "HighestAccuracy": 0,
    "RelevantInfo": "Provide all relevant information about your data set.",
    "Source": "Dr. Mustafa Kemal Yöntem, Nevşehir Hacı Bektaş Veli University, Faculty of Education, Department of Educational Sciences, muskemtem@hotmail.com \r\nDr. Kemal ADEM, Aksaray University, Faculty of Economics and Administrative Sciences, Department of Management Information Systems, kemaladem@gmail.com\r\nProf. Dr. Tahsin İlhan, Tokat GAZİOSMANPAŞA University, Faculty of Education, Department of Educational Sciences, tahsinilhan73@gmail.com\r\nLecturer Serhat Kılıçarslan, Tokat GAZİOSMANPAŞA University, Rectorate, Department of Informatics, serhatklc@gmail.com\r\n",
    "Acknowledgements": "Yöntem, M , Adem, K , İlhan, T , Kılıçarslan, S. (2019). DIVORCE PREDICTION USING CORRELATION BASED FEATURE SELECTION AND ARTIFICIAL NEURAL NETWORKS. Nevşehir Hacı Bektaş Veli University SBE Dergisi, 9 (1), 259-273. Retrieved from http://dergipark.org.tr/nevsosbilen/issue/46568/549416 ",
    "Area": "Life",
    "RelevantPapers": "Yöntem, M , Adem, K , İlhan, T , Kılıçarslan, S. (2019). DIVORCE PREDICTION USING CORRELATION BASED FEATURE SELECTION AND ARTIFICIAL NEURAL NETWORKS. Nevşehir Hacı Bektaş Veli University SBE Dergisi, 9 (1), 259-273. Retrieved from http://dergipark.org.tr/nevsosbilen/issue/46568/549416 ",
    "AttributeInfo": "1. If one of us apologizes when our discussion deteriorates, the discussion ends.\r\n2. I know we can ignore our differences, even if things get hard sometimes.\r\n3. When we need it, we can take our discussions with my spouse from the beginning and correct it.\r\n4. When I discuss with my spouse, to contact him will eventually work.\r\n5. The time I spent with my wife is special for us.\r\n6. We don't have time at home as partners.\r\n7. We are like two strangers who share the same environment at home rather than family.\r\n8. I enjoy our holidays with my wife.\r\n9. I enjoy traveling with my wife.\r\n10. Most of our goals are common to my spouse.\r\n11. I think that one day in the future, when I look back, I see that my spouse and I have been in harmony with each other.\r\n12. My spouse and I have similar values in terms of personal freedom.\r\n13. My spouse and I have similar sense of entertainment.\r\n14. Most of our goals for people (children, friends, etc.) are the same.\r\n15. Our dreams with my spouse are similar and harmonious.\r\n16. We're compatible with my spouse about what love should be.\r\n17. We share the same views about being happy in our life with my spouse\r\n18. My spouse and I have similar ideas about how marriage should be\r\n19. My spouse and I have similar ideas about how roles should be in marriage\r\n20. My spouse and I have similar values in trust.\r\n21. I know exactly what my wife likes.\r\n22. I know how my spouse wants to be taken care of when she/he sick.\r\n23. I know my spouse's favorite food.\r\n24. I can tell you what kind of stress my spouse is facing in her/his life.\r\n25. I have knowledge of my spouse's inner world.\r\n26. I know my spouse's basic anxieties. \r\n27. I know what my spouse's current sources of stress are.\r\n28. I know my spouse's hopes and wishes.\r\n29. I know my spouse very well.\r\n30. I know my spouse's friends and their social relationships.\r\n31. I feel aggressive when I argue with my spouse.\r\n32. When discussing with my spouse, I usually use expressions such as ‘you always’ or ‘you never’ .\r\n33. I can use negative statements about my spouse's personality during our discussions.\r\n34. I can use offensive expressions during our discussions.\r\n35. I can insult my spouse during our discussions.\r\n36. I can be humiliating when we discussions.\r\n37. My discussion with my spouse is not calm.\r\n38. I hate my spouse's way of open a subject.\r\n39. Our discussions often occur suddenly.\r\n40. We're just starting a discussion before I know what's going on.\r\n41. When I talk to my spouse about something, my calm suddenly breaks.\r\n42. When I argue with my spouse, ı only go out and I don't say a word.\r\n43. I mostly stay silent to calm the environment a little bit.\r\n44. Sometimes I think it's good for me to leave home for a while.\r\n45. I'd rather stay silent than discuss with my spouse.\r\n46. Even if I'm right in the discussion, I stay silent to hurt my spouse.\r\n47. When I discuss with my spouse, I stay silent because I am afraid of not being able to control my anger.\r\n48. I feel right in our discussions.\r\n49. I have nothing to do with what I've been accused of.\r\n50. I'm not actually the one who's guilty about what I'm accused of.\r\n51. I'm not the one who's wrong about problems at home.\r\n52. I wouldn't hesitate to tell my spouse about her/his inadequacy.\r\n53. When I discuss, I remind my spouse of her/his inadequacy.\r\n54. I'm not afraid to tell my spouse about her/his incompetence.\r\n",
    "FormatType": "Matrix",
    "NumHits": 0
}