{
    "ID": 6,
    "Name": "Artificial Characters",
    "Abstract": "Dataset artificially generated by using first order theory which describes structure of ten capital letters of English alphabet",
    "Types": "Multivariate",
    "Task": "Classification",
    "AttributeTypes": "Categorical, Integer, Real",
    "NumInstances": 6000,
    "NumAttributes": 7,
    "DateDonated": "1992-07-01",
    "MissingValues": 0,
    "URLFolder": "../machine-learning-databases/artificial-characters/",
    "URLReadme": "../machine-learning-databases/artificial-characters/character.names",
    "HighestAccuracy": 100,
    "RelevantInfo": "This database has been artificially generated by using a first order theory which describes the structure of ten capital letters of the English alphabet and a random choice theorem prover which accounts for etherogeneity in the instances. The capital letters represented are the following: A, C, D, E, F, G, H, L, P, R. Each instance is structured and is described by a set of segments (lines) which resemble the way an automatic program would segment an image. Each instance is stored in a separate file whose format is the following:\r\n              \r\nCLASS OBJNUM TYPE XX1 YY1 XX2 YY2 SIZE DIAG\r\n      \r\nwhere CLASS is an integer number indicating the class as described below, OBJNUM is an integer identifier of a segment (starting from 0) in the instance and the remaining columns represent attribute values. For further details, contact the author.\r\n",
    "Source": "Original Owners of Database:\r\n\r\n1. H. Altay Guvenir, PhD., \r\nBilkent University,\r\nDepartment of Computer Engineering and Information Science,\r\n06533 Ankara, Turkey\r\nPhone: +90 (312) 266 4133\r\nEmail: guvenir@cs.bilkent.edu.tr\r\n\r\n2. Burak Acar, M.S.,\r\nBilkent University, \r\nEE Eng. Dept. \r\n06533 Ankara, Turkey\r\nEmail: buraka@ee.bilkent.edu.tr\r\n\r\n3. Haldun Muderrisoglu, M.D., Ph.D., \r\nBaskent University, \r\nSchool of Medicine\r\nAnkara, Turkey\r\n\r\nDonor: \r\n\r\nH. Altay Guvenir\r\nBilkent University,\r\nDepartment of Computer Engineering and Information Science,\r\n06533 Ankara, Turkey\r\nPhone: +90 (312) 266 4133\r\nEmail: guvenir@cs.bilkent.edu.tr",
    "Acknowledgements": "",
    "Area": "Computer",
    "RelevantPapers": "M. Botta, A. Giordana, L. Saitta: \"Learning Fuzzy Concept Definitions\", IEEE-Fuzzy Conference, 1993.\r\nhttp://rexa.info/paper/138f26236fba64b4e5dbd4b707a69f2c10965e0c\r\n\r\nM. Botta, A. Giordana: \"Learning Quantitative Feature in a Symbolic Environment\", LNAI 542, 1991, pp. 296-305.\r\nhttp://rexa.info/paper/acd6f273aa2150ec614a9cd784a19e5f20add08e",
    "AttributeInfo": "      TYPE: the first attribute describes the type of segment and is always set to the string \"line\". Its C language type is char.\r\n\r\n      XX1,YY1,XX2,YY2: these attributes contain the initial and final coordinates of a segment in a cartesian plane. Their C language type is int.\r\n\r\n      SIZE: this is the length of a segment computed by using the geometric distance between two points A(X1,Y1) and B(X2,Y2). Its C language type is float.\r\n\r\n      DIAG: this is the length of the diagonal of the smallest rectangle which includes the picture of the character. The value of this attribute is the same in each object. Its C language type is float.\r\n",
    "FormatType": "",
    "NumHits": 29
}