{
    "ID": 92,
    "Name": "Challenger USA Space Shuttle O-Ring",
    "Abstract": "Task: predict the number of O-rings that experience thermal distress on a flight at 31 degrees F given data on the previous 23 shuttle flights",
    "Types": "Multivariate",
    "Task": "Regression",
    "AttributeTypes": "Integer",
    "NumInstances": 23,
    "NumAttributes": 4,
    "DateDonated": "1993-08-05",
    "MissingValues": 0,
    "URLFolder": "../machine-learning-databases/space-shuttle/",
    "URLReadme": "../machine-learning-databases/space-shuttle/o-ring-erosion.names",
    "HighestAccuracy": 0,
    "RelevantInfo": "There are two databases: (both use the same set of 5 attributes):\r\n1. Primary o-ring erosion and/or blowby\r\n2. Primary o-ring erosion only\r\n\r\nThe two databases are identical except for the 2nd attribute of the 21st instance (confirmed by David Draper on 8/5/93).\r\n\r\nEdited from (Draper, 1993):\r\n\r\nThe motivation for collecting this database was the explosion of the USA Space Shuttle Challenger on 28 January, 1986.  An investigation ensued into the reliability of the shuttle's propulsion system.  The explosion was eventually traced to the failure of one of the three field joints on one of the two solid booster rockets.  Each of these six field joints includes two O-rings, designated as primary and secondary, which fail when phenomena called erosion and blowby both occur. \r\n\r\nThe night before the launch a decision had to be made regarding launch safety.  The discussion among engineers and managers leading to this decision included concern that the probability of failure of the O-rings depended on the temperature t at launch, which was forecase to be 31 degrees F. There are strong engineering reasons based on the composition of O-rings to support the judgment that failure probability may rise monotonically as temperature drops.  One other variable, the pressure s at which safety testing for field join leaks was performed, was available, but its relevance to the failure process was unclear.\r\n       \r\nDraper's paper includes a menacing figure graphing the number of field joints experiencing stress vs. liftoff temperature for the 23 shuttle flights previous to the Challenger disaster.  No previous liftoff temperature was under 53 degrees F.  Although tremendous extrapolation must be done from the given data to assess risk at 31 degrees F, it is obvious even to the layman \"to foresee the unacceptably high risk created by launching at 31 degrees F.\"  For more information, see Draper (1993) or the other previous analyses.\r\n       \r\nThe task is to predict the number of O-rings that will experience thermal distress for a given flight when the launch temperature is below freezing.",
    "Source": "Original Owner:\r\n\r\nDavid Draper (draper@math.ucla.edu)\r\nUniversity of California, Los Angeles\r\n\r\nDonor: \r\n\r\nDavid Draper (draper@math.ucla.edu)",
    "Acknowledgements": "",
    "Area": "Physical",
    "RelevantPapers": "Draper,D. (1993).  Assessment and propagation of model uncertainty.  In Proceedings of the Fourth International Workshop on Artificial Intelligence and Statistics (pp. 497--509).  Ft. Lauderdale, FL:  Unpublished.\r\nhttp://rexa.info/paper/150b816894ae1bf07f15679b3e57b5ad9b47b392\r\n\r\nDalal,S.R., Fowlkes,E.B., & Hoadley,B. (1989). Risk analysis of the space shuttle: pre-Challenger prediction of failure.  Journal of the American Statisticians Association,  84, 945--957.\r\nhttp://rexa.info/paper/8657148d6d660ce011233d4f4212c38466c2021e\r\n\r\nLavine,M. (1991). Problems in extrapolation illustrated with space shuttle O-ring data.  Journal of the American Statisticians Association, 86, 919--922.\r\n   \r\nMartz H.F., & Zimmer, W.J. (1992). The risk of catastrophic failure of the solid rocket boosters on the space shuttle.  American Statistics, 46, 42--47. \r\nhttp://rexa.info/paper/635b95d712354b2551b7e5fc097d6179ba7e0999",
    "AttributeInfo": "     1. Number of O-rings at risk on a given flight\r\n     2. Number experiencing thermal distress\r\n     3. Launch temperature (degrees F)\r\n     4. Leak-check pressure (psi)\r\n     5. Temporal order of flight",
    "FormatType": "Dense-Matrix",
    "NumHits": 8982
}